[
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "It’s a fact: if you have a working knowledge of HTML, CSS, and JavaScript, you already have the tools you need to develop your own web or hybrid apps for mobile. In this session, you’ll learn how to use these open source web technologies to design and build apps for the iPhone, iPad, Android, etc. on the development platform of your choice—without using Objective-C, Swift, or Java.", 
    "author": "Jonathan Stark (Jonathan Stark Consulting)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41805", 
    "raw_description": "Presented by Jonathan Stark (Jonathan Stark Consulting). It’s a fact: if you have a working knowledge of HTML, CSS, and JavaScript, you already have the tools you need to develop your own web or hybrid apps for mobile. In this session, you’ll learn how to use these open source web technologies to design and build apps for the iPhone, iPad, Android, etc. on the development platform of your choice—without using Objective-C, Swift, or Java.", 
    "title": "Building apps that run everywhere with HTML5, CSS, JavaScript, and Apache Cordova", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "In this tutorial, you will learn about the motivations for using the microservice architecture and how it compares with more traditional monolithic architecture. We discuss the benefits and drawbacks of microservices. You will learn about strategies for refactoring a monolithic application into a set of microservices.", 
    "author": "Chris Richardson (Chris Richardson Consulting, Inc)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42506", 
    "raw_description": "Presented by Chris Richardson (Chris Richardson Consulting, Inc). In this tutorial, you will learn about the motivations for using the microservice architecture and how it compares with more traditional monolithic architecture. We discuss the benefits and drawbacks of microservices. You will learn about strategies for refactoring a monolithic application into a set of microservices.", 
    "title": "Introduction to microservices", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Building an application using microservices and don't know where to start?  How do services find each other?  How do I configure many instances of each service?  How do I see what's going on with my services? If you've asked these questions, this session will give you some answers using Spring Cloud and Netflix OSS to create microservices that are robust, discoverable, scalable & configurable.", 
    "author": "Spencer Gibb (Pivotal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41041", 
    "raw_description": "Presented by Spencer Gibb (Pivotal). Building an application using microservices and don't know where to start?  How do services find each other?  How do I configure many instances of each service?  How do I see what's going on with my services? If you've asked these questions, this session will give you some answers using Spring Cloud and Netflix OSS to create microservices that are robust, discoverable, scalable & configurable.", 
    "title": "Microservices with Spring Cloud and Netflix OSS", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "This session will expose you to a broad range of web security vulnerabilities and their solutions. We'll cover the basics such as XSS, CSRF, SQL Injection, and clickjacking.  We will also go into depth on issues of session management, password security, two-factor authentication, and much much more!", 
    "author": "Eli White (php[architect])", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40212", 
    "raw_description": "Presented by Eli White (php[architect]). This session will expose you to a broad range of web security vulnerabilities and their solutions. We'll cover the basics such as XSS, CSRF, SQL Injection, and clickjacking.  We will also go into depth on issues of session management, password security, two-factor authentication, and much much more!", 
    "title": "Web security essentials", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "DramaFever, the largest streaming video site for international content, uses AWS to power its streaming video platform, and has been running Docker in production since about October 2013 (well before it even went 1.0). This talk goes into detail about we use Docker to make development more consistent and deployment more repeatable.", 
    "author": "Bridget Kromhout (DramaFever)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42037", 
    "raw_description": "Presented by Bridget Kromhout (DramaFever). DramaFever, the largest streaming video site for international content, uses AWS to power its streaming video platform, and has been running Docker in production since about October 2013 (well before it even went 1.0). This talk goes into detail about we use Docker to make development more consistent and deployment more repeatable.", 
    "title": "Docker in production: Reality, not hype", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Thanks to Docker and containers, microservices architectures are no longer reserved to large organizations like Netflix or Amazon. Let's review the benefits of those architectures, for Devs and Ops, in projects big and small, and how to realize them with the open source container technology available today.", 
    "author": "Jérôme Petazzoni (Docker Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42001", 
    "raw_description": "Presented by Jérôme Petazzoni (Docker Inc.). Thanks to Docker and containers, microservices architectures are no longer reserved to large organizations like Netflix or Amazon. Let's review the benefits of those architectures, for Devs and Ops, in projects big and small, and how to realize them with the open source container technology available today.", 
    "title": "Microservices. Microservices everywhere!", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "We are now in an age where more people have phones than toilets, and there are more active cell phones than people on the planet. How do we protect all of these devices as they’re roaming around unsecured locations, especially when we want to pay for something.", 
    "author": "Jonathan LeBlanc (PayPal / Braintree)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40593", 
    "raw_description": "Presented by Jonathan LeBlanc (PayPal / Braintree). We are now in an age where more people have phones than toilets, and there are more active cell phones than people on the planet. How do we protect all of these devices as they’re roaming around unsecured locations, especially when we want to pay for something.", 
    "title": "Protecting the future of mobile payments", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "You've decided to level up your Git skills and have heard that rebasing is where it's at. In this session we'll talk about: WHY rebasing can make it easier to untangle your project's history; WHEN you should use rebase; WHAT rebasing actually does to your repository; and HOW it actually looks when things go right (and how to recover when things go wrong).", 
    "author": "Emma Jane Hogbin Westby (Git for Teams)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40462", 
    "raw_description": "Presented by Emma Jane Hogbin Westby (Git for Teams). You've decided to level up your Git skills and have heard that rebasing is where it's at. In this session we'll talk about: WHY rebasing can make it easier to untangle your project's history; WHEN you should use rebase; WHAT rebasing actually does to your repository; and HOW it actually looks when things go right (and how to recover when things go wrong).", 
    "title": "A rebasing workflow for Git", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Join this session to learn how to create a Java-based microservice using Spring Boot, containerize it using Maven plugins, and subsequently deploy a fleet of microservices and dependent components such as Redis using Kubernetes.  Toward the end of the session, let's take a look at how we can apply the same patterns to other runtimes, such as Vert.x and Grails.", 
    "author": "Ray Tsang (Google)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41359", 
    "raw_description": "Presented by Ray Tsang (Google). Join this session to learn how to create a Java-based microservice using Spring Boot, containerize it using Maven plugins, and subsequently deploy a fleet of microservices and dependent components such as Redis using Kubernetes.  Toward the end of the session, let's take a look at how we can apply the same patterns to other runtimes, such as Vert.x and Grails.", 
    "title": "Java-based microservices, containers, Kubernetes - how to", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Continuous delivery of a monolith is easy - just automate, automate, automate! But what challenges will you run into applying the same ideas to 300 microservices? Come and find out!", 
    "author": "Kevin Scaldeferri (New Relic)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41816", 
    "raw_description": "Presented by Kevin Scaldeferri (New Relic). Continuous delivery of a monolith is easy - just automate, automate, automate! But what challenges will you run into applying the same ideas to 300 microservices? Come and find out!", 
    "title": "Continuous delivery and large microservice architectures: Reflections on Ioncannon", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Learn how to build workflows that can help automate each part of your project's release lifecycle (build, test, review, merge, deployment, reporting, etc). We'll take a look at common language-based build tools, and learn how to set up Jenkins and/or Travis for build work and continuous integration (CI). Then, we'll compare various cloud deployment targets and learn about continuous delivery (CD).", 
    "author": "Ryan Jarvinen (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42187", 
    "raw_description": "Presented by Ryan Jarvinen (Red Hat). Learn how to build workflows that can help automate each part of your project's release lifecycle (build, test, review, merge, deployment, reporting, etc). We'll take a look at common language-based build tools, and learn how to set up Jenkins and/or Travis for build work and continuous integration (CI). Then, we'll compare various cloud deployment targets and learn about continuous delivery (CD).", 
    "title": "Building Release Pipelines on the Open Web", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "This talk will tell the story of a large-scale refactoring of our permissions model at GitHub. We’ll explain the problem, our solution, and then go over the tools we built, the techniques we used, and the lessons we learned while replacing this critical piece of our application live, side-by-side, and in production.", 
    "author": "Jesse Toth (GitHub), Nathan Witmer (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41888", 
    "raw_description": "Presented by Jesse Toth (GitHub), Nathan Witmer (GitHub). This talk will tell the story of a large-scale refactoring of our permissions model at GitHub. We’ll explain the problem, our solution, and then go over the tools we built, the techniques we used, and the lessons we learned while replacing this critical piece of our application live, side-by-side, and in production.", 
    "title": "Refactoring systems with confidence", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "JavaScript frameworks seem like death and taxes; inevitable and unavoidable. But that's not the way it needs to be, and actually, it must stop. A talk based on the zer framework manifesto: http://bitworking.org/news/2014/05/zero_framework_manifesto", 
    "author": "Joseph Gregorio (Google)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40210", 
    "raw_description": "Presented by Joseph Gregorio (Google). JavaScript frameworks seem like death and taxes; inevitable and unavoidable. But that's not the way it needs to be, and actually, it must stop. A talk based on the zer framework manifesto: http://bitworking.org/news/2014/05/zero_framework_manifesto", 
    "title": "Stop writing Javascript frameworks", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "There's been a lot of talk about reactive programming lately, but nobody really knows exactly what it is. I'll first talk a little bit about what reactive programming is, and then we'll dive into practical examples on how to use it with any front-end technology and particularly with AngularJS. We'll see how beautiful and clean our code can be when we use reactive code in the front end.", 
    "author": "Martin Gontovnikas (Auth0)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40373", 
    "raw_description": "Presented by Martin Gontovnikas (Auth0). There's been a lot of talk about reactive programming lately, but nobody really knows exactly what it is. I'll first talk a little bit about what reactive programming is, and then we'll dive into practical examples on how to use it with any front-end technology and particularly with AngularJS. We'll see how beautiful and clean our code can be when we use reactive code in the front end.", 
    "title": "Reactive front end", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "The new standard for web application development is microservices. In this talk we will review a modern web architecture, ways to fit different systems together, and how to scale and manage demand  from initial startup deployments to millions of users. We will talk about the importance of unification of the web delivery approach across multiple systems, and demo some new features of nginx.", 
    "author": "Nick Shadrin (Nginx, Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42161", 
    "raw_description": "Presented by Nick Shadrin (Nginx, Inc.). The new standard for web application development is microservices. In this talk we will review a modern web architecture, ways to fit different systems together, and how to scale and manage demand  from initial startup deployments to millions of users. We will talk about the importance of unification of the web delivery approach across multiple systems, and demo some new features of nginx.", 
    "title": "Connecting and deploying microservices at scale with nginx", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "In this talk, we'll learn all about Mesos - what it is, how you can leverage it to simplify your infrastructure and reduce AWS/cloud computing costs, and why you should develop your next application on top of it. This talk will give you the tools you need to understand whether Mesos is the right fit for your infrastructure, and several starting points for learning more about Mesos.", 
    "author": "David Greenberg (Two Sigma)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42353", 
    "raw_description": "Presented by David Greenberg (Two Sigma). In this talk, we'll learn all about Mesos - what it is, how you can leverage it to simplify your infrastructure and reduce AWS/cloud computing costs, and why you should develop your next application on top of it. This talk will give you the tools you need to understand whether Mesos is the right fit for your infrastructure, and several starting points for learning more about Mesos.", 
    "title": "Mesos: The operating system for your datacenter", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Botnets can take down virtually any site or service on the internet, including an entire country's internet backbone. Oftentimes your hear about a botnet's path of destruction, but you never hear about how they work. This talk will introduce you to the concepts behind botnets, and also show a live demonstration of a botnet on a sandboxed network.", 
    "author": "Bryan Smith (Fossetcon)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42341", 
    "raw_description": "Presented by Bryan Smith (Fossetcon). Botnets can take down virtually any site or service on the internet, including an entire country's internet backbone. Oftentimes your hear about a botnet's path of destruction, but you never hear about how they work. This talk will introduce you to the concepts behind botnets, and also show a live demonstration of a botnet on a sandboxed network.", 
    "title": "Build a botnet?", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "Single-page web applications offer users a rich, responsive experience, utilizing the browser as an application platform. We provide a framework-agnostic introduction to programming single-page applications, considered generically.  Server- and client-side routing, module API surfacing, bookmarking, and SEO strategies must be carefully managed in an SPA environment.", 
    "author": "Brian Capouch (Saint Josephs College), Nathan Samano (Saint Joseph's College (Indiana)), Craig Austgen (Saint Joseph's College)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42279", 
    "raw_description": "Presented by Brian Capouch (Saint Josephs College), Nathan Samano (Saint Joseph's College (Indiana)), Craig Austgen (Saint Joseph's College). Single-page web applications offer users a rich, responsive experience, utilizing the browser as an application platform. We provide a framework-agnostic introduction to programming single-page applications, considered generically.  Server- and client-side routing, module API surfacing, bookmarking, and SEO strategies must be carefully managed in an SPA environment.", 
    "title": "Programming single-page applications", 
    "room": "Portland 251"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Got the basics of Python down but want to dig in a little more? Have you wondered about functional programming, closures, decorators, context managers, generators, or list comprehensions, and when you should use them and how to test them? This hands-on tutorial will cover these intermediate subjects in detail, by applying them to programming a drone.", 
    "author": "Matt Harrison (MetaSnake)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42148", 
    "raw_description": "Presented by Matt Harrison (MetaSnake). Got the basics of Python down but want to dig in a little more? Have you wondered about functional programming, closures, decorators, context managers, generators, or list comprehensions, and when you should use them and how to test them? This hands-on tutorial will cover these intermediate subjects in detail, by applying them to programming a drone.", 
    "title": "Decorating drones: Using drones to delve deeper into intermediate Python", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "It’s a big world for small devices, and you need to be able to design not just for Android and iPhone, but the mobile world beyond as well. Over the course of this tutorial, you’ll learn critical skills in thinking about problems in a mobile context, how to apply these skills to address app design problems on any mobile platform, and how to design for future improvement.", 
    "author": "Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Christopher Neugebauer (@chrisjrn)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41534", 
    "raw_description": "Presented by Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Christopher Neugebauer (@chrisjrn). It’s a big world for small devices, and you need to be able to design not just for Android and iPhone, but the mobile world beyond as well. Over the course of this tutorial, you’ll learn critical skills in thinking about problems in a mobile context, how to apply these skills to address app design problems on any mobile platform, and how to design for future improvement.", 
    "title": "Cross-device, cross-platform: Designing for the entire mobile universe", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "This is not a typo: we are going to demonstrate and compare different orchestration systems, for scales both big and small. Within the span of this tutorial, we will build clusters together using open source software like Swarm, Mesos, and others.", 
    "author": "Steve Francia (Docker Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42004", 
    "raw_description": "Presented by Steve Francia (Docker Inc.). This is not a typo: we are going to demonstrate and compare different orchestration systems, for scales both big and small. Within the span of this tutorial, we will build clusters together using open source software like Swarm, Mesos, and others.", 
    "title": "Container orchestration at scale", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "You've dabbled a little in version control using Git. You can follow along with the various tutorials you've found online. But now you've been asked to implement a work flow strategy and you're not really sure how (or where) to start. You have a lot of choices, we'll help you pick the right one for your project.", 
    "author": "Emma Jane Hogbin Westby (Git for Teams)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40461", 
    "raw_description": "Presented by Emma Jane Hogbin Westby (Git for Teams). You've dabbled a little in version control using Git. You can follow along with the various tutorials you've found online. But now you've been asked to implement a work flow strategy and you're not really sure how (or where) to start. You have a lot of choices, we'll help you pick the right one for your project.", 
    "title": "Git for teams", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "There are tons of metrics that can be measured out there. Facebook likes, Twitter followers, website hits, database queries, number of VMs, cheapest lunch in the neighborhood, and many more. What if you could collect those metrics and choose the ones you'd like to present into a nice dashboard? And perhaps add easy analytics to it? Learn how to use Dashing together with platforms like Keen.io.", 
    "author": "Jonas Rosland (EMC), Kate Greenough (EMC)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41539", 
    "raw_description": "Presented by Jonas Rosland (EMC), Kate Greenough (EMC). There are tons of metrics that can be measured out there. Facebook likes, Twitter followers, website hits, database queries, number of VMs, cheapest lunch in the neighborhood, and many more. What if you could collect those metrics and choose the ones you'd like to present into a nice dashboard? And perhaps add easy analytics to it? Learn how to use Dashing together with platforms like Keen.io.", 
    "title": "Create beautiful dashboards from many sources of data using open technologies", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "There's always plenty to do in the world of free and open source software, but saying yes to it all eventually leads to burnout. Not every job, module or meeting is going to lead to more of the kinds of opportunities you want. When should you reinvent the wheel and when should you settle for something that's good enough?", 
    "author": "Deb Nicholson (Open Invention Network)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41644", 
    "raw_description": "Presented by Deb Nicholson (Open Invention Network). There's always plenty to do in the world of free and open source software, but saying yes to it all eventually leads to burnout. Not every job, module or meeting is going to lead to more of the kinds of opportunities you want. When should you reinvent the wheel and when should you settle for something that's good enough?", 
    "title": "Say No like a boss!", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "While it’s easy to pay lip service to the idea of innovating by failing fast, humans are both neurally geared and financially incentivized to avoid failure. How can we create an environment that makes failing fast safe for the participants and their organizations?", 
    "author": "Leslie Hawthorn (Elastic), Amye Scavarda (Amye.org)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40721", 
    "raw_description": "Presented by Leslie Hawthorn (Elastic), Amye Scavarda (Amye.org). While it’s easy to pay lip service to the idea of innovating by failing fast, humans are both neurally geared and financially incentivized to avoid failure. How can we create an environment that makes failing fast safe for the participants and their organizations?", 
    "title": "Fear of failing fast: How to avoid sabotaging your success", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "Fast and scalable analysis of big data has become a critical competitive advantage for companies. There are open source tools like Apache Hadoop and Apache Spark that are providing opportunities for companies to solve these big data problems in a scalable way. Platforms like these have become the foundation of the big data analysis movement.", 
    "author": "Kenny Bastani (Digital Insight)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42200", 
    "raw_description": "Presented by Kenny Bastani (Digital Insight). Fast and scalable analysis of big data has become a critical competitive advantage for companies. There are open source tools like Apache Hadoop and Apache Spark that are providing opportunities for companies to solve these big data problems in a scalable way. Platforms like these have become the foundation of the big data analysis movement.", 
    "title": "Open source big graph analytics on Neo4j with Apache Spark", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Search engine technology is rapidly evolving from keyword-based lookups, to a highly sophisticated ranking engine capable of incorporating many different features across complex data types.  With the latest changes in Solr and Lucene, it is now possible to ask more interesting questions of multi-structured content than ever before, making them indispensable tools in the data science toolbox.", 
    "author": "Grant Ingersoll (Lucidworks)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41489", 
    "raw_description": "Presented by Grant Ingersoll (Lucidworks). Search engine technology is rapidly evolving from keyword-based lookups, to a highly sophisticated ranking engine capable of incorporating many different features across complex data types.  With the latest changes in Solr and Lucene, it is now possible to ask more interesting questions of multi-structured content than ever before, making them indispensable tools in the data science toolbox.", 
    "title": "Solr for data science", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Swarm intelligence (SI) algorithms mimic the behaviors of groups such as flocks of birds and schools of fish. This session describes in detail four major SI algorithms: amoeba method optimization, particle swam optimization, simulated bee colony optimization, and firefly algorithm optimization. Attendees will receive Python source code for each algorithm.", 
    "author": "James McCaffrey (Microsoft)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41002", 
    "raw_description": "Presented by James McCaffrey (Microsoft). Swarm intelligence (SI) algorithms mimic the behaviors of groups such as flocks of birds and schools of fish. This session describes in detail four major SI algorithms: amoeba method optimization, particle swam optimization, simulated bee colony optimization, and firefly algorithm optimization. Attendees will receive Python source code for each algorithm.", 
    "title": "Solve optimization problems using swarm intelligence", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Your favorite development language may be great, but it inevitably has a few misfeatures that make every programming task unnecessarily harder. That doesn't mean you need to find a new language; you can fix your existing one. And, happily, you already have exactly the right tool to do that: your existing language.", 
    "author": "Damian Conway (Thoughtstream)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40632", 
    "raw_description": "Presented by Damian Conway (Thoughtstream). Your favorite development language may be great, but it inevitably has a few misfeatures that make every programming task unnecessarily harder. That doesn't mean you need to find a new language; you can fix your existing one. And, happily, you already have exactly the right tool to do that: your existing language.", 
    "title": "Don't change languages. Change your language.", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "Most data scientists will tell you they spend a greater percent of their time munging data than they do building predictive models. In this session, learn how to spend less time writing queries and more time building models, by combining the flexibility of a NoSQL graph database with R—an open source statistical programming language—to analyze Twitter data in a reproducible, low-effort workflow.", 
    "author": "Nicole White (Neo4j)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41967", 
    "raw_description": "Presented by Nicole White (Neo4j). Most data scientists will tell you they spend a greater percent of their time munging data than they do building predictive models. In this session, learn how to spend less time writing queries and more time building models, by combining the flexibility of a NoSQL graph database with R—an open source statistical programming language—to analyze Twitter data in a reproducible, low-effort workflow.", 
    "title": "Open source data science with NoSQL and R", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "Many classic design patterns and traditional Python idioms remain relevant today. However, the language has grown, the problem spaces we address keep shifting, and best practices for software development have matured. Thus, the set of best-of-breed patterns and idioms has changed, some classics fading, new stars emerging. This talk explores today's realities in Python patterns and idioms.", 
    "author": "Anna Martelli Ravenscroft (Self), Alex Martelli (Google)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41099", 
    "raw_description": "Presented by Anna Martelli Ravenscroft (Self), Alex Martelli (Google). Many classic design patterns and traditional Python idioms remain relevant today. However, the language has grown, the problem spaces we address keep shifting, and best practices for software development have matured. Thus, the set of best-of-breed patterns and idioms has changed, some classics fading, new stars emerging. This talk explores today's realities in Python patterns and idioms.", 
    "title": "Handle your design conundrums with modern Python design patterns", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "Graph relationships are everywhere. In fact, more often than not, analyzing relationships between points in your datasets lets you extract more business value from your data. This presentation will provide an introduction into two of the most used Hadoop ecosystem projects in the area of scalable graph processing: Apache Giraph and Spark GraphX.", 
    "author": "Roman Shaposhnik (Pivotal Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41616", 
    "raw_description": "Presented by Roman Shaposhnik (Pivotal Inc.). Graph relationships are everywhere. In fact, more often than not, analyzing relationships between points in your datasets lets you extract more business value from your data. This presentation will provide an introduction into two of the most used Hadoop ecosystem projects in the area of scalable graph processing: Apache Giraph and Spark GraphX.", 
    "title": "Scalable graph analysis with Apache Giraph and Spark GraphX", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "The Etsy organization has grown by a significant amount over the last five years. As a company grows, more thought must be put into the techniques that it uses to communicate and deal with failures. This talk will cover several techniques that have helped foster a Just Culture, one in which an effort is made to balance both safety and accountability.", 
    "author": "John Goulah (Etsy)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41159", 
    "raw_description": "Presented by John Goulah (Etsy). The Etsy organization has grown by a significant amount over the last five years. As a company grows, more thought must be put into the techniques that it uses to communicate and deal with failures. This talk will cover several techniques that have helped foster a Just Culture, one in which an effort is made to balance both safety and accountability.", 
    "title": "Building a successful organization by mastering failure", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "IT is undergoing a revolution, and database administration is no exception. As Ops teams evolve to reliability engineers, developers and traditional systems administrators find themselves diving into the world of the DBA. In this session, we take the model of site reliability engineering and guide you through the components of the craft of DB architecture/operations in that context.", 
    "author": "Charity Majors (Parse/Facebook)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41146", 
    "raw_description": "Presented by Charity Majors (Parse/Facebook). IT is undergoing a revolution, and database administration is no exception. As Ops teams evolve to reliability engineers, developers and traditional systems administrators find themselves diving into the world of the DBA. In this session, we take the model of site reliability engineering and guide you through the components of the craft of DB architecture/operations in that context.", 
    "title": "Database reliability engineering, modernizing the DBA role", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Dataflow is an often underestimated challenge in realizing the value of big data. Messaging-based approaches are fast and well understood, and solid open source options exist. However, this talk makes the case that transport-oriented messaging is not the right abstraction for large distributed enterprise data flow, and describes how Apache NiFi is designed to solve these problems.", 
    "author": "Joe Witt (Onyara Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42463", 
    "raw_description": "Presented by Joe Witt (Onyara Inc.). Dataflow is an often underestimated challenge in realizing the value of big data. Messaging-based approaches are fast and well understood, and solid open source options exist. However, this talk makes the case that transport-oriented messaging is not the right abstraction for large distributed enterprise data flow, and describes how Apache NiFi is designed to solve these problems.", 
    "title": "Beyond messaging: Enterprise dataflow with Apache NiFi", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "In 2008, Nate Silver wowed the public by correctly predicting the outcome of the U.S. elections in 49 out of 50 states. As it turns out, you don't have to be a statistician to perform such analyses. In this talk, I introduce the Bash scripting language and how it can be used to perform advanced number crunching.", 
    "author": "Robert Aboukhalil (Cold Spring Harbor Laboratory)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41650", 
    "raw_description": "Presented by Robert Aboukhalil (Cold Spring Harbor Laboratory). In 2008, Nate Silver wowed the public by correctly predicting the outcome of the U.S. elections in 49 out of 50 states. As it turns out, you don't have to be a statistician to perform such analyses. In this talk, I introduce the Bash scripting language and how it can be used to perform advanced number crunching.", 
    "title": "Adventures in data science with Bash", 
    "room": "Portland 252"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Docker was one of last year’s most talked about open source projects - but what is it? And what does it mean for deploying applications?  This tutorial will explain what Docker is and where it fits in with other deployment and configuration management techniques. Students will then learn the basics of working with Docker containers, how to “dockerize” an app, and some emerging best practices.", 
    "author": "Andrew Baker (Twilio)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42203", 
    "raw_description": "Presented by Andrew Baker (Twilio). Docker was one of last year’s most talked about open source projects - but what is it? And what does it mean for deploying applications?  This tutorial will explain what Docker is and where it fits in with other deployment and configuration management techniques. Students will then learn the basics of working with Docker containers, how to “dockerize” an app, and some emerging best practices.", 
    "title": "Docker 101: Introduction to Docker", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "One of the new, hot libraries in the JavaScript world is React, and there is reason that it is getting so much attention: it offers some productivity gains you will not believe. In this workshop, we will cover React at a high level and then get in and write some code.", 
    "author": "Brian Holt (Netflix)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42482", 
    "raw_description": "Presented by Brian Holt (Netflix). One of the new, hot libraries in the JavaScript world is React, and there is reason that it is getting so much attention: it offers some productivity gains you will not believe. In this workshop, we will cover React at a high level and then get in and write some code.", 
    "title": "Intro to React and effective design patterns", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Most modern web APIs prefer JSON because of its interoperability. All modern languages have excellent JSON support, but large-scale environments often require more than simple serialization/de-serialization. This tutorial shows how to leverage JSON Schema, Search, and Transform along with simple tooling to enhance a developer’s workflow to build elegant, powerful, and efficient applications.", 
    "author": "Tom Marrs (LivingSocial)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42342", 
    "raw_description": "Presented by Tom Marrs (LivingSocial). Most modern web APIs prefer JSON because of its interoperability. All modern languages have excellent JSON support, but large-scale environments often require more than simple serialization/de-serialization. This tutorial shows how to leverage JSON Schema, Search, and Transform along with simple tooling to enhance a developer’s workflow to build elegant, powerful, and efficient applications.", 
    "title": "JSON at work: Schema, Search, and Transform", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Microservices are taking over our production environments and a new approach to managing applications will be required in order to scale and address new challenges that arise. In this tutorial you'll take a hands-on approach to learning how to solve these problems from the ground up with CoreOS, the container optimized OS, and Kubernetes, the latest open source orchestration system for containers.", 
    "author": "Kelsey Hightower (CoreOS)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42529", 
    "raw_description": "Presented by Kelsey Hightower (CoreOS). Microservices are taking over our production environments and a new approach to managing applications will be required in order to scale and address new challenges that arise. In this tutorial you'll take a hands-on approach to learning how to solve these problems from the ground up with CoreOS, the container optimized OS, and Kubernetes, the latest open source orchestration system for containers.", 
    "title": "Taming microservices with CoreOS and Kubernetes", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "Sometimes, learning what not to do is the best path to success. This absurd, humorous, and completely serious talk will teach you everything you need to know to ensure that a healthy open source project meets its demise. Whether you are a user testing the open source waters, an experienced maintainer, or open source ate your hard drive, discover techniques to ruin your corner of the world.", 
    "author": "Brandon Keepers (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42193", 
    "raw_description": "Presented by Brandon Keepers (GitHub). Sometimes, learning what not to do is the best path to success. This absurd, humorous, and completely serious talk will teach you everything you need to know to ensure that a healthy open source project meets its demise. Whether you are a user testing the open source waters, an experienced maintainer, or open source ate your hard drive, discover techniques to ruin your corner of the world.", 
    "title": "99 ways to kill an open source project", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "This is a live demonstration of hacking into the processor embedded in an SD card, effectively turning the device into a covert Raspberry Pi-class computer under your complete control -- running Linux. There will be a discussion of similar attacks against ARM processors embedded in current HDD drive controllers.", 
    "author": "Federico Lucifredi (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41574", 
    "raw_description": "Presented by Federico Lucifredi (Red Hat). This is a live demonstration of hacking into the processor embedded in an SD card, effectively turning the device into a covert Raspberry Pi-class computer under your complete control -- running Linux. There will be a discussion of similar attacks against ARM processors embedded in current HDD drive controllers.", 
    "title": "Hardware hacking 101: There is plenty of room at the bottom", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Go is quickly becoming one of the many must-have items in our toolboxes. In this talk I will describe the common pitfalls and misunderstandings for people who have an extensive background in interpreted languages like myself. I will tell you all about my failures so you don't have to repeat them!", 
    "author": "Daisuke Maki (HDE Inc)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41029", 
    "raw_description": "Presented by Daisuke Maki (HDE Inc). Go is quickly becoming one of the many must-have items in our toolboxes. In this talk I will describe the common pitfalls and misunderstandings for people who have an extensive background in interpreted languages like myself. I will tell you all about my failures so you don't have to repeat them!", 
    "title": "How to think in Go: Stories from a Perl developer turned Go developer", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "The Go programming language lets you write high performance network servers without resorting to event loops and callback spaghetti.", 
    "author": "David Cheney (Canonical)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41475", 
    "raw_description": "Presented by David Cheney (Canonical). The Go programming language lets you write high performance network servers without resorting to event loops and callback spaghetti.", 
    "title": "High performance servers without the event loop", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "This talk will start off with the basics of what Syntactically Awesome StyleSheets are, what features and functionality they have to offer, and why they're a great tool to have in your arsenal. We'll then delve into how to use Sass in developing your own sites and which tools you'll want to use alongside it, complete with a live demo and some in-production examples.", 
    "author": "Lucy Wyman (OSU Open Source Lab)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42173", 
    "raw_description": "Presented by Lucy Wyman (OSU Open Source Lab). This talk will start off with the basics of what Syntactically Awesome StyleSheets are, what features and functionality they have to offer, and why they're a great tool to have in your arsenal. We'll then delve into how to use Sass in developing your own sites and which tools you'll want to use alongside it, complete with a live demo and some in-production examples.", 
    "title": "Sass: What it is, how it's used, and why it's so syntactically awesome", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "There's a war on open standards and software brewing, and it's happening in a surprising location: under the hood of your car. In this talk, we discuss the storied history of OBD, a suite of related diagnostic protocols that's used by virtually every car sold in the US, EU, and China -- and how your ability to own and examine your vehicle's data might be threatened if some people have their way.", 
    "author": "John Feminella (UpHex)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42272", 
    "raw_description": "Presented by John Feminella (UpHex). There's a war on open standards and software brewing, and it's happening in a surprising location: under the hood of your car. In this talk, we discuss the storied history of OBD, a suite of related diagnostic protocols that's used by virtually every car sold in the US, EU, and China -- and how your ability to own and examine your vehicle's data might be threatened if some people have their way.", 
    "title": "Getting under your hood: Cars and computers", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Building modern, accessible web apps can be daunting. This talk goes beyond the foundational aspects of accessibility to discuss higher-level concepts and challenges for making modern web UI accessible, demonstrating specific solutions and best practices for: -Common UI components(modals, form validation) -Single-page architecture -Summarizing complex content -Providing accessible help text", 
    "author": "Patrick Fox (Razorfish)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41783", 
    "raw_description": "Presented by Patrick Fox (Razorfish). Building modern, accessible web apps can be daunting. This talk goes beyond the foundational aspects of accessibility to discuss higher-level concepts and challenges for making modern web UI accessible, demonstrating specific solutions and best practices for: -Common UI components(modals, form validation) -Single-page architecture -Summarizing complex content -Providing accessible help text", 
    "title": "Modern accessibility for modern web apps", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "Most nonprofit organizations depend on volunteers. And most volunteer organizations are asked how in the world they recruit and keep volunteers.  While not every organization is the same, there are definitely some best practices that many open source software projects have discovered and evolved.", 
    "author": "Stormy Peters (Cloud Foundry Foundation), Avni Khatri (Kids on Computers)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42067", 
    "raw_description": "Presented by Stormy Peters (Cloud Foundry Foundation), Avni Khatri (Kids on Computers). Most nonprofit organizations depend on volunteers. And most volunteer organizations are asked how in the world they recruit and keep volunteers.  While not every organization is the same, there are definitely some best practices that many open source software projects have discovered and evolved.", 
    "title": "Grow an organization by planting volunteers", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "This project deals with data from the Internet of Things, and particularly with data from a bike sharing service. The goal is to visualize and analyze the most popular routes, as well as to implement an intelligent alarm system to restock the bike stations in a timely manner. Time series prediction, geo-localization, and predictive analytics techniques have been used in this project.", 
    "author": "Rosaria Silipo (KNIME)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40455", 
    "raw_description": "Presented by Rosaria Silipo (KNIME). This project deals with data from the Internet of Things, and particularly with data from a bike sharing service. The goal is to visualize and analyze the most popular routes, as well as to implement an intelligent alarm system to restock the bike stations in a timely manner. Time series prediction, geo-localization, and predictive analytics techniques have been used in this project.", 
    "title": "Advanced analytics for the Internet of Things", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "When companies start adopting open source, they face common challenges, like how do you contribute back or what do you even open source. Companies like Google, Intel, Facebook, and Twitter have chosen to establish open source offices to facilitate working with open source communities. In this session, learn lessons from Twitter on how to start your own open source office.", 
    "author": "Chris Aniszczyk (Twitter)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41468", 
    "raw_description": "Presented by Chris Aniszczyk (Twitter). When companies start adopting open source, they face common challenges, like how do you contribute back or what do you even open source. Companies like Google, Intel, Facebook, and Twitter have chosen to establish open source offices to facilitate working with open source communities. In this session, learn lessons from Twitter on how to start your own open source office.", 
    "title": "Creating an open source office: Lessons from Twitter", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "Test-driven development's great, but what happens when you find yourself working on code where automated testing took a back seat to being shipped? This talk looks at techniques for automated testing of late-stage or even production code, and how to use this to fix bugs in your code. Testing late in life isn't a lost cause any more!", 
    "author": "Christopher Neugebauer (@chrisjrn)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40413", 
    "raw_description": "Presented by Christopher Neugebauer (@chrisjrn). Test-driven development's great, but what happens when you find yourself working on code where automated testing took a back seat to being shipped? This talk looks at techniques for automated testing of late-stage or even production code, and how to use this to fix bugs in your code. Testing late in life isn't a lost cause any more!", 
    "title": "Test-driven repair", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "How do you choose the technology to run your business? You should use the best tools for the job, of course. But the precise definitions of the words \"best\" and \"job\" are tricky. This talk gives these terms shape, and introduces a framework for thinking about new technology rigorously, holistically, and systematically.", 
    "author": "Dan  McKinley (Stripe)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43596", 
    "raw_description": "Presented by Dan  McKinley (Stripe). How do you choose the technology to run your business? You should use the best tools for the job, of course. But the precise definitions of the words \"best\" and \"job\" are tricky. This talk gives these terms shape, and introduces a framework for thinking about new technology rigorously, holistically, and systematically.", 
    "title": "Choose boring technology", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Faster pages...profit! Right? Despite what common sense and every case study might tell you, we found out that isn't always true. When you get 20 million visitors a month and make a lot of your money from advertising (the enemy of speed), you have tons of opportunity/obligation to understand which kinds of speed matter. This is a story about hope, disappointment, discovery, and triumph.", 
    "author": "Eddie Canales (CrossChx)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41459", 
    "raw_description": "Presented by Eddie Canales (CrossChx). Faster pages...profit! Right? Despite what common sense and every case study might tell you, we found out that isn't always true. When you get 20 million visitors a month and make a lot of your money from advertising (the enemy of speed), you have tons of opportunity/obligation to understand which kinds of speed matter. This is a story about hope, disappointment, discovery, and triumph.", 
    "title": "Speed kills: When faster pages mean less revenue", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "Engineering teams at Netflix can follow the latest industry trends and sometimes they even create them.  No one single team is responsible for innovation: does this generate opportunity or waste or both? The Engineering Tools team helps to direct other teams’ experimentation toward new products, while preserving their own ability to innovate.", 
    "author": "Mike McGarr (Netflix)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42183", 
    "raw_description": "Presented by Mike McGarr (Netflix). Engineering teams at Netflix can follow the latest industry trends and sometimes they even create them.  No one single team is responsible for innovation: does this generate opportunity or waste or both? The Engineering Tools team helps to direct other teams’ experimentation toward new products, while preserving their own ability to innovate.", 
    "title": "Freedom and responsibility @Netflix: Centralized team in a decentralized world", 
    "room": "Portland 255"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "The number of frameworks, patterns, platforms, and APIs available has exploded.  Defining the architecture of a system requires navigating a sea of options. This talk frames architectural decisions in the context of behavioral economics. It covers how good or bad choice architecture can impact the software architecture and how organizations can guide engineers toward better choices.", 
    "author": "Michelle Brush (Cerner Corporation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40470", 
    "raw_description": "Presented by Michelle Brush (Cerner Corporation). The number of frameworks, patterns, platforms, and APIs available has exploded.  Defining the architecture of a system requires navigating a sea of options. This talk frames architectural decisions in the context of behavioral economics. It covers how good or bad choice architecture can impact the software architecture and how organizations can guide engineers toward better choices.", 
    "title": "The paradox of technology choice", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "What if instead of a broad location, you could have pinpoint location awareness of someone in a physical space. How could this change everything about how we interact with the physical world? In this session we'll explore open beacon technology, and how we can use these systems to change everything from shopping to accessibility for the disabled, all built on top of a mobile device.", 
    "author": "Jonathan LeBlanc (PayPal / Braintree)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41808", 
    "raw_description": "Presented by Jonathan LeBlanc (PayPal / Braintree). What if instead of a broad location, you could have pinpoint location awareness of someone in a physical space. How could this change everything about how we interact with the physical world? In this session we'll explore open beacon technology, and how we can use these systems to change everything from shopping to accessibility for the disabled, all built on top of a mobile device.", 
    "title": "Building a mobile location-aware system with beacons", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Reactive programming is the trendy new way to build desktop and mobile apps. Reacting to user input over time can prove to be difficult, because of the enormous amount of state we need to keep track of. In this talk we will discover how to improve our reactive applications by removing the need for state entirely. This allows us to clearly reason about, and react to, user input over time.", 
    "author": "Amy Palamountain (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42294", 
    "raw_description": "Presented by Amy Palamountain (GitHub). Reactive programming is the trendy new way to build desktop and mobile apps. Reacting to user input over time can prove to be difficult, because of the enormous amount of state we need to keep track of. In this talk we will discover how to improve our reactive applications by removing the need for state entirely. This allows us to clearly reason about, and react to, user input over time.", 
    "title": "Space, time, and state", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "As Uber moves into new markets with new services, designing for high availability and scalability presents some interesting challenges. Even brief outages in the service are very costly, with real-world impact on people's lives. This talk will cover the Uber architecture and how it handles every failure we can think of.", 
    "author": "Matt Ranney (Uber)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42073", 
    "raw_description": "Presented by Matt Ranney (Uber). As Uber moves into new markets with new services, designing for high availability and scalability presents some interesting challenges. Even brief outages in the service are very costly, with real-world impact on people's lives. This talk will cover the Uber architecture and how it handles every failure we can think of.", 
    "title": "Designing for failure: How Uber scaled its realtime market platform", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Investigate a hacked WordPress website, and learn what the hacker has left behind, which tools will help find the vulnerability and point of entrance, how to seal up the most common problem areas, and how to set up notifications to help you spot a hack more quickly in the future. Even though we will be going through a WordPress website, most of the tools discussed are applicable to any website.", 
    "author": "Beth Tucker Long (Treeline Design)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40555", 
    "raw_description": "Presented by Beth Tucker Long (Treeline Design). Investigate a hacked WordPress website, and learn what the hacker has left behind, which tools will help find the vulnerability and point of entrance, how to seal up the most common problem areas, and how to set up notifications to help you spot a hack more quickly in the future. Even though we will be going through a WordPress website, most of the tools discussed are applicable to any website.", 
    "title": "I've been hacked, now what?", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "At Netflix, the big data platform is the foundation for analytics that drives all product decisions. As for scale, it is one of the top three largest services running at Netflix. In this talk, you will learn about our open source-powered big data architecture in the AWS cloud, and how we build out the technology stack that comprises the big data platform at Netflix today.", 
    "author": "Eva Tse (Netflix, Inc)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42228", 
    "raw_description": "Presented by Eva Tse (Netflix, Inc). At Netflix, the big data platform is the foundation for analytics that drives all product decisions. As for scale, it is one of the top three largest services running at Netflix. In this talk, you will learn about our open source-powered big data architecture in the AWS cloud, and how we build out the technology stack that comprises the big data platform at Netflix today.", 
    "title": "The evolution of the big data platform at Netflix", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Herein, an open source developer community considers itself _algorithmically_. This project shows how to surface data insights from the developer email forums for just about any Apache open source project. It leverages machine learning and advanced analytics in Apache Spark, but also makes use of Docker containers for standalone NLP services.", 
    "author": "Paco Nathan (O'Reilly Media)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41579", 
    "raw_description": "Presented by Paco Nathan (O'Reilly Media). Herein, an open source developer community considers itself _algorithmically_. This project shows how to surface data insights from the developer email forums for just about any Apache open source project. It leverages machine learning and advanced analytics in Apache Spark, but also makes use of Docker containers for standalone NLP services.", 
    "title": "Microservices, containers, and machine learning", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "How do you tackle real-world web platform performance problems in modern websites and apps? This session starts with a basic understanding of the web platform, and then explores a set of problem/solution pairs built with industry-standard performance guidance. In the talk, we will demonstrate performance tips and tricks that will help you improve the performance of your apps and sites today.", 
    "author": "Doris Chen (Microsoft)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41417", 
    "raw_description": "Presented by Doris Chen (Microsoft). How do you tackle real-world web platform performance problems in modern websites and apps? This session starts with a basic understanding of the web platform, and then explores a set of problem/solution pairs built with industry-standard performance guidance. In the talk, we will demonstrate performance tips and tricks that will help you improve the performance of your apps and sites today.", 
    "title": "Practical performance tips and tricks to make your HTML/JavaScript faster", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "We are collecting increasing amounts of data to analyze, so we can understand how to better serve our customers.  But how do you know that the data collected is useful or even being used?  Using Netflix’s experience building data platforms, we will talk about how gaining insight into the use of your data can improve your own platform.", 
    "author": "Charles Smith (Netflix)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42111", 
    "raw_description": "Presented by Charles Smith (Netflix). We are collecting increasing amounts of data to analyze, so we can understand how to better serve our customers.  But how do you know that the data collected is useful or even being used?  Using Netflix’s experience building data platforms, we will talk about how gaining insight into the use of your data can improve your own platform.", 
    "title": "Measuring big data - understanding data by usage", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "In order to scale its operations to serve more than 245 million customers around the world each week, Walmart eCommercecompletely re-engineered its entire technology stack -- including making huge investments in OpenStack, Node.JS and other technologies to create a global platform that would rival those of the best technology companies.", 
    "author": "Jeremy King (Walmart Global E-Commerce)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41968", 
    "raw_description": "Presented by Jeremy King (Walmart Global E-Commerce). In order to scale its operations to serve more than 245 million customers around the world each week, Walmart eCommercecompletely re-engineered its entire technology stack -- including making huge investments in OpenStack, Node.JS and other technologies to create a global platform that would rival those of the best technology companies.", 
    "title": "Walmart labs: finding our success by transitioning to open source", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "One challenge in building distributed systems is actually running and testing distributed systems. This session will show how developers at VoltDB simplify development and testing using Docker and other container technologies.", 
    "author": "John Hugg (VoltDB)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42391", 
    "raw_description": "Presented by John Hugg (VoltDB). One challenge in building distributed systems is actually running and testing distributed systems. This session will show how developers at VoltDB simplify development and testing using Docker and other container technologies.", 
    "title": "Using Docker to simplify distributed systems development", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "Ruth Suehle and Tom Callaway, authors of _Raspberry Pi Hacks_ (O’Reilly, December 2013) offer technical tips for makers, hackers, and tinkerers who want to take advantage of the Raspberry Pi. You'll learn universally useful things, like how to add a power switch, followed by a show-and-tell of fun things that Ruth and Tom as well as many others have built.", 
    "author": "Ruth Suehle (Red Hat), Tom \"spot\" Callaway (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41491", 
    "raw_description": "Presented by Ruth Suehle (Red Hat), Tom \"spot\" Callaway (Red Hat). Ruth Suehle and Tom Callaway, authors of _Raspberry Pi Hacks_ (O’Reilly, December 2013) offer technical tips for makers, hackers, and tinkerers who want to take advantage of the Raspberry Pi. You'll learn universally useful things, like how to add a power switch, followed by a show-and-tell of fun things that Ruth and Tom as well as many others have built.", 
    "title": "Raspberry Pi hacks", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "The IPython Notebook is perfect for many data science tasks, including rapid iteration for data munging and cleaning; exploration and visualization; creating a transparent data processing pipeline workflow; and beautiful presentation of results. This talk will explore overall best practices, with special attention to these use cases and how to get the most out of IPython Notebook for each one.", 
    "author": "Jonathan Whitmore (Silicon Valley Data Science)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42315", 
    "raw_description": "Presented by Jonathan Whitmore (Silicon Valley Data Science). The IPython Notebook is perfect for many data science tasks, including rapid iteration for data munging and cleaning; exploration and visualization; creating a transparent data processing pipeline workflow; and beautiful presentation of results. This talk will explore overall best practices, with special attention to these use cases and how to get the most out of IPython Notebook for each one.", 
    "title": "IPython Notebook best practices for data science", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "You’ve got mad computer hacking skills, and an app idea to take over the world! But there's one problem: you’re not a designer and need your app to look stunning. This talk will show you how to quickly build a beautiful, modern user interface without having to hire a designer.", 
    "author": "Caleb Madrigal (FireEye)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41563", 
    "raw_description": "Presented by Caleb Madrigal (FireEye). You’ve got mad computer hacking skills, and an app idea to take over the world! But there's one problem: you’re not a designer and need your app to look stunning. This talk will show you how to quickly build a beautiful, modern user interface without having to hire a designer.", 
    "title": "Building a modern UI for programmers", 
    "room": " Portland 256"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "The design of an open source project will greatly effect a user's experience, and open source typically lacks solid design. In this session we'll talk about the current state of design and how we can raise the bar in an open source community.", 
    "author": "Garth Braithwaite (Adobe)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41447", 
    "raw_description": "Presented by Garth Braithwaite (Adobe). The design of an open source project will greatly effect a user's experience, and open source typically lacks solid design. In this session we'll talk about the current state of design and how we can raise the bar in an open source community.", 
    "title": "Open source is ugly: Improving UX and UI design", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "We'll take a deep dive down the stack, into how the internet works to magically make Google's home page appear in our web browser. Topics will range from URL parsing and DNS resolution, through HTTP, TCP, IP, and routing, and all the way back up to browser rendering.", 
    "author": "Graeme Mathieson (Wossname Industries)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41094", 
    "raw_description": "Presented by Graeme Mathieson (Wossname Industries). We'll take a deep dive down the stack, into how the internet works to magically make Google's home page appear in our web browser. Topics will range from URL parsing and DNS resolution, through HTTP, TCP, IP, and routing, and all the way back up to browser rendering.", 
    "title": "You type \"google.com\" into your browser bar and press enter: What happens next?", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Every designer has had to justify designs to non-designers, yet most lack the ability to explain their choices in a compelling way. Effectively articulating design decisions is critical to a project’s success because the most articulate person wins. This session offers practical advice for talking to managers, developers, and other stakeholders to win them over and create the best user experience.", 
    "author": "Tom Greever (Bitovi)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42625", 
    "raw_description": "Presented by Tom Greever (Bitovi). Every designer has had to justify designs to non-designers, yet most lack the ability to explain their choices in a compelling way. Effectively articulating design decisions is critical to a project’s success because the most articulate person wins. This session offers practical advice for talking to managers, developers, and other stakeholders to win them over and create the best user experience.", 
    "title": "Articulating design decisions", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "This talk will look at how taking a modular, object-oriented approach to CSS can turn frontend woes into frontend wins. We’ll examine modern CSS approaches like OOCSS, SMACSS, and BEM and demonstrate how they will help to not only decouple your CSS styles and reduce specificity conflicts, but how they will also help to decouple your CSS and HTML from your JavaScript and feature specs.", 
    "author": "Julie Cameron (Articulate)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40414", 
    "raw_description": "Presented by Julie Cameron (Articulate). This talk will look at how taking a modular, object-oriented approach to CSS can turn frontend woes into frontend wins. We’ll examine modern CSS approaches like OOCSS, SMACSS, and BEM and demonstrate how they will help to not only decouple your CSS styles and reduce specificity conflicts, but how they will also help to decouple your CSS and HTML from your JavaScript and feature specs.", 
    "title": "Decoupling the frontend through modular CSS", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Did you know that some development practices actively encourage flow while others prevent you from ever getting there in the first place? This talk will lay out the conditions of flow, what established programming techniques encourage it, and strategies for finding ways to create flow sessions in your daily development life, regardless of what your established software-development lifecycle is.", 
    "author": "Caskey Dickson (GOOGLE)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40312", 
    "raw_description": "Presented by Caskey Dickson (GOOGLE). Did you know that some development practices actively encourage flow while others prevent you from ever getting there in the first place? This talk will lay out the conditions of flow, what established programming techniques encourage it, and strategies for finding ways to create flow sessions in your daily development life, regardless of what your established software-development lifecycle is.", 
    "title": "Coding in the FLOW: Structuring your development session to promote a state of flow", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Promises, streams, observables, and behaviors are some of the building blocks of event driven programming. What makes each of these tick and when would you choose one over another?", 
    "author": "Kris Kowal (Uber)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41568", 
    "raw_description": "Presented by Kris Kowal (Uber). Promises, streams, observables, and behaviors are some of the building blocks of event driven programming. What makes each of these tick and when would you choose one over another?", 
    "title": "A general theory of reactivity", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "The vulnerability management team for the OpenStack project handles hundreds of incoming reports of potential security vulnerabilities, and publishes dozens of advisories every year. Find out how we reconcile vulnerability reporting with our public design and open community development ideals, and learn about the free tooling and published processes we employ to make it easier.", 
    "author": "Jeremy Stanley (OpenStack Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41753", 
    "raw_description": "Presented by Jeremy Stanley (OpenStack Foundation). The vulnerability management team for the OpenStack project handles hundreds of incoming reports of potential security vulnerabilities, and publishes dozens of advisories every year. Find out how we reconcile vulnerability reporting with our public design and open community development ideals, and learn about the free tooling and published processes we employ to make it easier.", 
    "title": "Vulnerability management for open software development", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "Modern software development places a high value on doing things The Right Way(tm). But what if you're just someone with an idea, some coding knowledge, and a nontrivial amount of intimidation? In this session, a sysadmin-turned-developer will take you through a battle with the demons of self-doubt, and help you discover the ONE CRAZY TRICK YOUR BRAIN DOESN'T WANT YOU TO KNOW!", 
    "author": "Wade Minter (AdWerx)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41448", 
    "raw_description": "Presented by Wade Minter (AdWerx). Modern software development places a high value on doing things The Right Way(tm). But what if you're just someone with an idea, some coding knowledge, and a nontrivial amount of intimidation? In this session, a sysadmin-turned-developer will take you through a battle with the demons of self-doubt, and help you discover the ONE CRAZY TRICK YOUR BRAIN DOESN'T WANT YOU TO KNOW!", 
    "title": "\"You code like a sysadmin\" - Impostor Syndrome for the modern developer", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "I've worked as a 100% remote employee for six different companies. Through this, I've learned the good, the bad, and the ugly about remote work (as well as time shifted asynchronous work). In this session we will discuss the benefits and drawbacks of remote work, for both the employee and the company. Learn the tricks needed, both procedural and technological, to make this possible!", 
    "author": "Eli White (php[architect])", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40214", 
    "raw_description": "Presented by Eli White (php[architect]). I've worked as a 100% remote employee for six different companies. Through this, I've learned the good, the bad, and the ugly about remote work (as well as time shifted asynchronous work). In this session we will discuss the benefits and drawbacks of remote work, for both the employee and the company. Learn the tricks needed, both procedural and technological, to make this possible!", 
    "title": "Remote working / asynchronous working", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "In true open source fashion, a community's failures are often as visible as their successes. Failing can provide a learning experience, but many mistakes are still made which can easily be avoided, even by experienced open source communities. Learn about these points of fail that open source projects have experienced, and see how badly your favorite FOSS project fails.", 
    "author": "Tom \"spot\" Callaway (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41110", 
    "raw_description": "Presented by Tom \"spot\" Callaway (Red Hat). In true open source fashion, a community's failures are often as visible as their successes. Failing can provide a learning experience, but many mistakes are still made which can easily be avoided, even by experienced open source communities. Learn about these points of fail that open source projects have experienced, and see how badly your favorite FOSS project fails.", 
    "title": "This is why you fail: The avoidable mistakes open source projects STILL make", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "At Puppet Labs, we’ve adopted and developed techniques for getting our ideas in front of our community in a manner that leads to reliable feedback. Join us to learn about what we’ve found to be effective, and how that has affected the way we plan, design, and build.", 
    "author": "Joe Wagner (Puppet Labs)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41389", 
    "raw_description": "Presented by Joe Wagner (Puppet Labs). At Puppet Labs, we’ve adopted and developed techniques for getting our ideas in front of our community in a manner that leads to reliable feedback. Join us to learn about what we’ve found to be effective, and how that has affected the way we plan, design, and build.", 
    "title": "UX for open source: Getting the most from an engaged community", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "In this talk, I'll show you how to write a straightforward specification that is easy to implement in any programming language.  I'll do this by sharing the story of JMESPath, a query language for JSON that currently has implementations in seven languages, and the lessons learned in creating the JMESPath specification. You'll leave ready to write easy-to-implement specifications.", 
    "author": "James Saryerwinnie (AWS)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42218", 
    "raw_description": "Presented by James Saryerwinnie (AWS). In this talk, I'll show you how to write a straightforward specification that is easy to implement in any programming language.  I'll do this by sharing the story of JMESPath, a query language for JSON that currently has implementations in seven languages, and the lessons learned in creating the JMESPath specification. You'll leave ready to write easy-to-implement specifications.", 
    "title": "How to write a specification: Implementing a library in seven programming languages", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "The Open Source Initiative has changed from a licensing-focussed organisation to a force uniting open source projects, developers, and advocates worldwide. Hear how it happened, what's happening next, and why this is important to your career and business.", 
    "author": "Simon Phipps (Wipro), Deborah Bryant (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41801", 
    "raw_description": "Presented by Simon Phipps (Wipro), Deborah Bryant (Red Hat). The Open Source Initiative has changed from a licensing-focussed organisation to a force uniting open source projects, developers, and advocates worldwide. Hear how it happened, what's happening next, and why this is important to your career and business.", 
    "title": "How to use OSI's resources to change the open source world", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "It's something we all do, but how it's done can be haphazard. I'm talking about troubleshooting, an often underappreciated skill. This talk will get you thinking about this critical discipline in a more formal way. We'll cover: Strategies: recipes to quickly get you from \"broken\" to \"fixed\"; Virtues: the mindset and behavior of a good troubleshooter; Cleaning up: learning from failures.", 
    "author": "Jason Maxham (The Art Of Troubleshooting)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42165", 
    "raw_description": "Presented by Jason Maxham (The Art Of Troubleshooting). It's something we all do, but how it's done can be haphazard. I'm talking about troubleshooting, an often underappreciated skill. This talk will get you thinking about this critical discipline in a more formal way. We'll cover: Strategies: recipes to quickly get you from \"broken\" to \"fixed\"; Virtues: the mindset and behavior of a good troubleshooter; Cleaning up: learning from failures.", 
    "title": "The art of troubleshooting", 
    "room": "D135/136"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Scala powers some of the biggest companies and fastest applications in the world. Find out why so many programmers are enamored of this language. We'll start with the basics of Scala, try out the features in the REPL, and then build an application. If you already know Javascript, Ruby, Python, or Java then you'll do great in this class.", 
    "author": "Jason Swartz (Mesosphere)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41115", 
    "raw_description": "Presented by Jason Swartz (Mesosphere). Scala powers some of the biggest companies and fastest applications in the world. Find out why so many programmers are enamored of this language. We'll start with the basics of Scala, try out the features in the REPL, and then build an application. If you already know Javascript, Ruby, Python, or Java then you'll do great in this class.", 
    "title": "Get started developing with Scala", 
    "room": "D136"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Nim is an emerging programming language that brings together the indentation-based syntax of Python, the speed of C, and the meta programming of Lisp. Nim scales from simple script-like programs up to full-blown system programs like compilers or 3D engines thanks to its layered language design.", 
    "author": "Andreas Rumpf (3DICC)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42497", 
    "raw_description": "Presented by Andreas Rumpf (3DICC). Nim is an emerging programming language that brings together the indentation-based syntax of Python, the speed of C, and the meta programming of Lisp. Nim scales from simple script-like programs up to full-blown system programs like compilers or 3D engines thanks to its layered language design.", 
    "title": "Nim - The ultimate introduction", 
    "room": "D136"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "This tool-agnostic tutorial is for those with the software chops and interest to create data visualizations, who want to elevate the look and feel of their work. Attendees will workshop an in-progress data visualization. They will learn design best practices and how to navigate the critique process, and then develop their own work on-site with guidance from two experts.", 
    "author": "Julie Steele (Silicon Valley Data Science), Susie Lu (Silicon Valley Data Science)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41688", 
    "raw_description": "Presented by Julie Steele (Silicon Valley Data Science), Susie Lu (Silicon Valley Data Science). This tool-agnostic tutorial is for those with the software chops and interest to create data visualizations, who want to elevate the look and feel of their work. Attendees will workshop an in-progress data visualization. They will learn design best practices and how to navigate the critique process, and then develop their own work on-site with guidance from two experts.", 
    "title": "Bland to beautiful: Data visualization workshop", 
    "room": "D136"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Get started with d3.js, the most powerful JavaScript tool for creating data visualizations on the web.  We'll start from scratch, and build an interactive scatterplot by the end of the session.", 
    "author": "Scott Murray (University of San Francisco)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42458", 
    "raw_description": "Presented by Scott Murray (University of San Francisco). Get started with d3.js, the most powerful JavaScript tool for creating data visualizations on the web.  We'll start from scratch, and build an interactive scatterplot by the end of the session.", 
    "title": "An introduction to d3.js: From scattered to scatterplot", 
    "room": "D136"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Join Meteor expert Josh Owens as he walks through live coding a Meteor.js app from scratch and gets it working with the built-in Cordova support. Learn how easy it is to build a new mobile app with Meteor.js.", 
    "author": "Josh Owens (Meteor Club)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41400", 
    "raw_description": "Presented by Josh Owens (Meteor Club). Join Meteor expert Josh Owens as he walks through live coding a Meteor.js app from scratch and gets it working with the built-in Cordova support. Learn how easy it is to build a new mobile app with Meteor.js.", 
    "title": "Building a mobile app with Meteor.js, Cordova, and MongoDB", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Flask, a popular Python web framework, has many tutorials available online which use an SQL database to store information about the website’s users and their activities. In this tutorial, we will replace SQL with Neo4j, an open source graph database, in order to build a simple microblog application with social features that are otherwise too complex to model and express in SQL.", 
    "author": "Nicole White (Neo4j)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42146", 
    "raw_description": "Presented by Nicole White (Neo4j). Flask, a popular Python web framework, has many tutorials available online which use an SQL database to store information about the website’s users and their activities. In this tutorial, we will replace SQL with Neo4j, an open source graph database, in order to build a simple microblog application with social features that are otherwise too complex to model and express in SQL.", 
    "title": "Building a Python web application using Flask and Neo4j", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Learn to program in Rust, a new systems programming language emphasizing safety and performance. Rust offers the same degree of control over performance as C and C++, but also makes strong memory safety guarantees: Rust programs are free of dangling pointers, leaks, null pointer dereferences and buffer overruns, making the language well-suited for security-sensitive and multithreaded code.", 
    "author": "Jim Blandy (Mozilla Corporation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41995", 
    "raw_description": "Presented by Jim Blandy (Mozilla Corporation). Learn to program in Rust, a new systems programming language emphasizing safety and performance. Rust offers the same degree of control over performance as C and C++, but also makes strong memory safety guarantees: Rust programs are free of dangling pointers, leaks, null pointer dereferences and buffer overruns, making the language well-suited for security-sensitive and multithreaded code.", 
    "title": "Programming in Rust", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Sass, the CSS preprocessor, is increasingly an important tool for creating websites. In this tutorial, you'll learn the basics of structuring your Sass files, creating variables, writing if/else statements, working with mixins, and more.", 
    "author": "Jen Kramer (Jen Kramer)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41969", 
    "raw_description": "Presented by Jen Kramer (Jen Kramer). Sass, the CSS preprocessor, is increasingly an important tool for creating websites. In this tutorial, you'll learn the basics of structuring your Sass files, creating variables, writing if/else statements, working with mixins, and more.", 
    "title": "Introducing Sass", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "We don’t see how code executes. We take peeks, using console.logs and breakpoints, but they don’t tell the whole story. This talk shows future toolmakers and (non-) visual thinkers how to take off our blindfolds.", 
    "author": "Jan Paul Posma (Brigade)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42069", 
    "raw_description": "Presented by Jan Paul Posma (Brigade). We don’t see how code executes. We take peeks, using console.logs and breakpoints, but they don’t tell the whole story. This talk shows future toolmakers and (non-) visual thinkers how to take off our blindfolds.", 
    "title": "Visualizing program execution", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Join a discussion with representatives from well-known tech companies to discuss the challenges of building and running an open source office at scale.", 
    "author": "Chris DiBona (Google), Chris Aniszczyk (Twitter), Chris Kelly (GitHub), Will Norris (Google), Christine Abernathy (Facebook), Gianugo Rabellino (Microsoft)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44987", 
    "raw_description": "Presented by Chris DiBona (Google), Chris Aniszczyk (Twitter), Chris Kelly (GitHub), Will Norris (Google), Christine Abernathy (Facebook), Gianugo Rabellino (Microsoft). Join a discussion with representatives from well-known tech companies to discuss the challenges of building and running an open source office at scale.", 
    "title": "Building and running an open source programs office: Lessons from the TODO Group", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Everyone at OSCON knows that good data coupled with modern open source technology can revolutionize business. But does senior management know? This presentation is about how to convince very powerful people with limited tech literacy that investing in good data and good data technology helps promote the organization’s mission.", 
    "author": "Linda Powell (Consumer Financial Protection Bureau)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41864", 
    "raw_description": "Presented by Linda Powell (Consumer Financial Protection Bureau). Everyone at OSCON knows that good data coupled with modern open source technology can revolutionize business. But does senior management know? This presentation is about how to convince very powerful people with limited tech literacy that investing in good data and good data technology helps promote the organization’s mission.", 
    "title": "Talking to non-technical people about data (especially if they’re your boss)", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "Based on six years of research and organization visits, I present the \"Trust Organization Manifesto,\" a radically different and yet surprisingly well-tested set of guidelines for self-organizing a company where \"work is joy.\"", 
    "author": "Bruce Eckel (Mindview, LLC)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41505", 
    "raw_description": "Presented by Bruce Eckel (Mindview, LLC). Based on six years of research and organization visits, I present the \"Trust Organization Manifesto,\" a radically different and yet surprisingly well-tested set of guidelines for self-organizing a company where \"work is joy.\"", 
    "title": "Creating trust organizations", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Pingo is a uniform Python API for devices that have programmable I/O for physical computing: Raspberry Pi, Arduino TRE, Intel Edison, BeagleBone Black etc. The design of the Arduino board and IDE made device programming accessible, and the design of the Pingo API aims to do the same with the Internet of Things, bringing interactive discovery and high-level services to embedded systems development.", 
    "author": "Luciano Ramalho (Python.pro.br)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40410", 
    "raw_description": "Presented by Luciano Ramalho (Python.pro.br). Pingo is a uniform Python API for devices that have programmable I/O for physical computing: Raspberry Pi, Arduino TRE, Intel Edison, BeagleBone Black etc. The design of the Arduino board and IDE made device programming accessible, and the design of the Pingo API aims to do the same with the Internet of Things, bringing interactive discovery and high-level services to embedded systems development.", 
    "title": "Pingo means \"pin, go!\": Universal IoT programming in Python", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "CQL3 has a relational-database-centric abstraction that hides many key details of the underlying storage. Though CQL can be an efficient and convenient tool to use when querying, knowing how CQL actually maps to Cassandra's storage structure is key to being able to create scalable and flexible data models.", 
    "author": "Mike Biglan (Twenty Ideas), Elijah Hamovitz (Analytic Spot)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42290", 
    "raw_description": "Presented by Mike Biglan (Twenty Ideas), Elijah Hamovitz (Analytic Spot). CQL3 has a relational-database-centric abstraction that hides many key details of the underlying storage. Though CQL can be an efficient and convenient tool to use when querying, knowing how CQL actually maps to Cassandra's storage structure is key to being able to create scalable and flexible data models.", 
    "title": "Data modeling Cassandra using CQL3", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Pinterest’s iOS team uses over 30 open source libraries to build their app. Pinterest engineer Garrett Moon will explain how Pinterest moves quickly and maintains world-class stability, while shipping a new version of the app every three weeks. Hear harrowing tales of tracking down deadlocks, rewriting popular caching libraries, and implementing a homegrown image downloading and caching library.", 
    "author": "Garrett Moon (Pinterest)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41854", 
    "raw_description": "Presented by Garrett Moon (Pinterest). Pinterest’s iOS team uses over 30 open source libraries to build their app. Pinterest engineer Garrett Moon will explain how Pinterest moves quickly and maintains world-class stability, while shipping a new version of the app every three weeks. Hear harrowing tales of tracking down deadlocks, rewriting popular caching libraries, and implementing a homegrown image downloading and caching library.", 
    "title": "Open source at scale: Building Pinterest’s iOS app", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "Developments like the `concurrent.futures` classes, coroutine delegation with `yield from` and the `asyncio` module together represent a major new chapter in the evolution of Python, and are the best reasons to upgrade to Python 3. This talk will show how these tools bring concurrent programming within reach of even casual programmers, with dramatic boosts in throughput.", 
    "author": "Luciano Ramalho (Python.pro.br)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41211", 
    "raw_description": "Presented by Luciano Ramalho (Python.pro.br). Developments like the `concurrent.futures` classes, coroutine delegation with `yield from` and the `asyncio` module together represent a major new chapter in the evolution of Python, and are the best reasons to upgrade to Python 3. This talk will show how these tools bring concurrent programming within reach of even casual programmers, with dramatic boosts in throughput.", 
    "title": "Plate spinning: Modern concurrency in Python", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "C++ is hot again. Find out why. This talk will cover why engineers looking for performance choose C++, and where C++ fits in a world in which solutions are increasingly created using different languages for different components. You will get a historical perspective of C++, focusing on what's going on in the C++ community right now and where the language and its user base is heading.", 
    "author": "Jon Kalb (A9.com)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41619", 
    "raw_description": "Presented by Jon Kalb (A9.com). C++ is hot again. Find out why. This talk will cover why engineers looking for performance choose C++, and where C++ fits in a world in which solutions are increasingly created using different languages for different components. You will get a historical perspective of C++, focusing on what's going on in the C++ community right now and where the language and its user base is heading.", 
    "title": "When Performance Counts: C++ in the 21st Century", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "Take a step back from your normal programming approach and discover a new way of looking at problems.  All living organisms' information systems are based on chemical processes.  What can we learn by using this metaphor of chemistry in our programming?", 
    "author": "Carin Meier (Cognitect)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41208", 
    "raw_description": "Presented by Carin Meier (Cognitect). Take a step back from your normal programming approach and discover a new way of looking at problems.  All living organisms' information systems are based on chemical processes.  What can we learn by using this metaphor of chemistry in our programming?", 
    "title": "Unconventional programming with chemical computing", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "This session will cover the new features in Cassandra 3.0, including JSON support, user-defined types, and global indexes. These allow engineers to deliver even better performance and productivity in their application development.", 
    "author": "Jonathan Ellis (DataStax, Inc)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41341", 
    "raw_description": "Presented by Jonathan Ellis (DataStax, Inc). This session will cover the new features in Cassandra 3.0, including JSON support, user-defined types, and global indexes. These allow engineers to deliver even better performance and productivity in their application development.", 
    "title": "Cassandra 3.0: improved productivity with JSON", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "Technology shouldn't require all of our attention, just some of it, and only when necessary. This talk will cover how to use principles of calm technology to design the next generation of connected devices. We'll look at notification styles, compressing information into other senses, and designing for the least amount of cognitive overhead.", 
    "author": "Amber Case (Esri)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41052", 
    "raw_description": "Presented by Amber Case (Esri). Technology shouldn't require all of our attention, just some of it, and only when necessary. This talk will cover how to use principles of calm technology to design the next generation of connected devices. We'll look at notification styles, compressing information into other senses, and designing for the least amount of cognitive overhead.", 
    "title": "Designing calm technology", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "You love using open source software. It's done right by you and now you want to contribute back. You get your patch all ready and... the boss says No! Don't feel alone. Enterprises everywhere are trying to figure this out. I'll walk you through the risks to business that actually exist and how you can help manage them. Maybe armed with this information your boss will say... Yes!", 
    "author": "Patrick McFadin (Datastax)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41984", 
    "raw_description": "Presented by Patrick McFadin (Datastax). You love using open source software. It's done right by you and now you want to contribute back. You get your patch all ready and... the boss says No! Don't feel alone. Enterprises everywhere are trying to figure this out. I'll walk you through the risks to business that actually exist and how you can help manage them. Maybe armed with this information your boss will say... Yes!", 
    "title": "Help! I want to contribute to an open source project but my boss says no", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "This session will show attendees how to build reactive services using Akka and Scala. Reactive services are scalable, reliable, and efficient, and we'll demonstrate the basic model, a simple development workflow, and the tools and libraries that make it all work.", 
    "author": "Thomas Lockney (Nike and PNWScala)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42132", 
    "raw_description": "Presented by Thomas Lockney (Nike and PNWScala). This session will show attendees how to build reactive services using Akka and Scala. Reactive services are scalable, reliable, and efficient, and we'll demonstrate the basic model, a simple development workflow, and the tools and libraries that make it all work.", 
    "title": "Designing reactive systems with Akka", 
    "room": "D137/138"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "In this new workshop, Jono Bacon, leading community manager from Ubuntu and XPRIZE, author of _The Art of Community_, and founder of the Community Leadership Summit, will share key lessons for how to build a strong and empowered community, navigate internal teams, build buy-in and governance, manage conflict, and more. Come and get the behind-the-scenes recipe for building a strong community.", 
    "author": "Jono Bacon (XPRIZE Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42512", 
    "raw_description": "Presented by Jono Bacon (XPRIZE Foundation). In this new workshop, Jono Bacon, leading community manager from Ubuntu and XPRIZE, author of _The Art of Community_, and founder of the Community Leadership Summit, will share key lessons for how to build a strong and empowered community, navigate internal teams, build buy-in and governance, manage conflict, and more. Come and get the behind-the-scenes recipe for building a strong community.", 
    "title": "Community leadership workshop", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Design sprints are a time-boxed, disciplined way to get validation on a concept so you write code that gets used and not trashed. This workshop will take you through a mini-design sprint so you can get first-hand experience of what it's like to participate in one. You’ll walk away with ideas and the knowledge of how to implement these frameworks in your organization.", 
    "author": "C Todd Lombardo (Constant Contact's InnoLoft)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42627", 
    "raw_description": "Presented by C Todd Lombardo (Constant Contact's InnoLoft). Design sprints are a time-boxed, disciplined way to get validation on a concept so you write code that gets used and not trashed. This workshop will take you through a mini-design sprint so you can get first-hand experience of what it's like to participate in one. You’ll walk away with ideas and the knowledge of how to implement these frameworks in your organization.", 
    "title": "Design Sprints for Developers", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Haskell has a reputation as a difficult language to learn.  This tutorial sets out to teach the useful part of Haskell -- avoiding the theoretical and computer science bits which so many find confusing.  Learn to write programs in Haskell with this tutorial.  You can learn the difficult bits later if you want.", 
    "author": "Robert \"r0ml\" Lefkowitz (self)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42077", 
    "raw_description": "Presented by Robert \"r0ml\" Lefkowitz (self). Haskell has a reputation as a difficult language to learn.  This tutorial sets out to teach the useful part of Haskell -- avoiding the theoretical and computer science bits which so many find confusing.  Learn to write programs in Haskell with this tutorial.  You can learn the difficult bits later if you want.", 
    "title": "Demystifying Haskell", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Clojure is an elegant, powerful language.  With functional programming style and immutable data, we can solve the problem of concurrency that is very difficult to deal with in other languages.", 
    "author": "Carin Meier (Cognitect)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42495", 
    "raw_description": "Presented by Carin Meier (Cognitect). Clojure is an elegant, powerful language.  With functional programming style and immutable data, we can solve the problem of concurrency that is very difficult to deal with in other languages.", 
    "title": "Solving the concurrency problem with Clojure", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "Learning to develop device drivers can be intimidating, but Linux makes it simpler than ever to write your own device driver. Using a simple driver for a monochromatic character display as a guide, we will briefly explore important topics for developing embedded Linux device drivers.", 
    "author": "Nick Gudman (Hewlett Packard)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42151", 
    "raw_description": "Presented by Nick Gudman (Hewlett Packard). Learning to develop device drivers can be intimidating, but Linux makes it simpler than ever to write your own device driver. Using a simple driver for a monochromatic character display as a guide, we will briefly explore important topics for developing embedded Linux device drivers.", 
    "title": "Introduction to developing embedded Linux device drivers", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Keeping code and design in sync across large teams and multiple projects can be a big challenge. At the Consumer Financial Protection Bureau, a new federal agency, the in-house design and development team has created its own modular front-end framework and style guide. Team members will talk about how this has fostered cross-team collaboration and improved the consistency of their products.", 
    "author": "Scott Cranfill (Consumer Financial Protection Bureau), Mollie Bates (Consumer Financial Protection Bureau)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42014", 
    "raw_description": "Presented by Scott Cranfill (Consumer Financial Protection Bureau), Mollie Bates (Consumer Financial Protection Bureau). Keeping code and design in sync across large teams and multiple projects can be a big challenge. At the Consumer Financial Protection Bureau, a new federal agency, the in-house design and development team has created its own modular front-end framework and style guide. Team members will talk about how this has fostered cross-team collaboration and improved the consistency of their products.", 
    "title": "Building a modular front-end framework and style guide for a large organization", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "We often say that interviews should be a two-way street, but it doesn’t always feel that way. Here we talk about specific techniques for humanely interviewing engineers, and why this is good for business. We'll also talk about tips for candidates that help move things along.", 
    "author": "Jay Goel (Rent the Runway)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41989", 
    "raw_description": "Presented by Jay Goel (Rent the Runway). We often say that interviews should be a two-way street, but it doesn’t always feel that way. Here we talk about specific techniques for humanely interviewing engineers, and why this is good for business. We'll also talk about tips for candidates that help move things along.", 
    "title": "Humane interviewing", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "What can be learned about a person's internet habits if every packet in and out was logged by a transparent man-in-the-middle? Here's what I discovered from a few months of self-experimentation.", 
    "author": "Josh Deprez (Google Australia)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41975", 
    "raw_description": "Presented by Josh Deprez (Google Australia). What can be learned about a person's internet habits if every packet in and out was logged by a transparent man-in-the-middle? Here's what I discovered from a few months of self-experimentation.", 
    "title": "High adventures in sniffing my own metadata", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "1GHz ARM Cortex A8, 512MB RAM, 4GB NAND Flash, WiFi, Bluetooth - and it's completely open source.  Also, it costs $9. See how, why, and what it means for the future of open hardware.", 
    "author": "Dave Rauchwerk (Next Thing Co)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45285", 
    "raw_description": "Presented by Dave Rauchwerk (Next Thing Co). 1GHz ARM Cortex A8, 512MB RAM, 4GB NAND Flash, WiFi, Bluetooth - and it's completely open source.  Also, it costs $9. See how, why, and what it means for the future of open hardware.", 
    "title": "Building the $9 computer, or how I learned to stop worrying and love embedded Linux", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Board games are hard at the best of times – you have to find friends who have the free time to play, find a game everyone is happy to play, and more! When friends move elsewhere, things get even harder!  This sessions explores the challenges of telepresence board gaming. Learn why and how you should care, how the problems are being addressed, and how it’s relevant to remote collaboration.", 
    "author": "Tim Nugent (lonely.coffee)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42012", 
    "raw_description": "Presented by Tim Nugent (lonely.coffee). Board games are hard at the best of times – you have to find friends who have the free time to play, find a game everyone is happy to play, and more! When friends move elsewhere, things get even harder!  This sessions explores the challenges of telepresence board gaming. Learn why and how you should care, how the problems are being addressed, and how it’s relevant to remote collaboration.", 
    "title": "Rolling dice alone: Board games with remote friends", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Developers know that participating in the open source community can be a win-win for both employers and employees. But how do you convince the legal department and executives? In this presentation we will share Rackspace's internal policy documents that allow all employees to participate in open source projects, and explain the details that convinced everyone to let us put it in place.", 
    "author": "Van Lindberg (Rackspace)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41847", 
    "raw_description": "Presented by Van Lindberg (Rackspace). Developers know that participating in the open source community can be a win-win for both employers and employees. But how do you convince the legal department and executives? In this presentation we will share Rackspace's internal policy documents that allow all employees to participate in open source projects, and explain the details that convinced everyone to let us put it in place.", 
    "title": "Steal this open source policy!", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "If you believe in a world where we should have the right to run our own communications and own our data, then learn how “Vector” fills the void!", 
    "author": "David  Kelnar (Vector)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45294", 
    "raw_description": "Presented by David  Kelnar (Vector). If you believe in a world where we should have the right to run our own communications and own our data, then learn how “Vector” fills the void!", 
    "title": "Introducing an open source answer for modern collaboration", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "In this session, you’ll learn about game design: the art and science of constructing enjoyable, engaging games. We aren't doing any coding, and we’re not talking game engine development - instead, we’ll be taking a deep dive into game design theory, using it to understand how people interact with rules, and how to use it to improve your community, your company, your project, and your software.", 
    "author": "Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Jonathon Manning (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41947", 
    "raw_description": "Presented by Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Jonathon Manning (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee). In this session, you’ll learn about game design: the art and science of constructing enjoyable, engaging games. We aren't doing any coding, and we’re not talking game engine development - instead, we’ll be taking a deep dive into game design theory, using it to understand how people interact with rules, and how to use it to improve your community, your company, your project, and your software.", 
    "title": "How Do I Game Design? Design games, understand people!", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "So you want to turn your cool hardware device into a new product—what could possibly go wrong? If you’ve ever helped crowdfund a hardware product, then you’ve probably gotten some insight into many of the things that do go wrong. This talk will explore some common mistakes and why, despite the challenges, an open-source approach to hardware manufacturing makes sense.", 
    "author": "Kipp Bradford (The Kippworks)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42285", 
    "raw_description": "Presented by Kipp Bradford (The Kippworks). So you want to turn your cool hardware device into a new product—what could possibly go wrong? If you’ve ever helped crowdfund a hardware product, then you’ve probably gotten some insight into many of the things that do go wrong. This talk will explore some common mistakes and why, despite the challenges, an open-source approach to hardware manufacturing makes sense.", 
    "title": "Manufacturing open source hardware", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "The cybersecurity community has difficulty working together around breaches, out of legal and public relations concerns, but can share best practices. The open source Assimilation Project  compares system configurations against best practices in near-real-time.  This talk outlines our efforts to include more security experts in our community, and translate the results into open source code.", 
    "author": "Alan Robertson (Assimilation Systems Limited)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41884", 
    "raw_description": "Presented by Alan Robertson (Assimilation Systems Limited). The cybersecurity community has difficulty working together around breaches, out of legal and public relations concerns, but can share best practices. The open source Assimilation Project  compares system configurations against best practices in near-real-time.  This talk outlines our efforts to include more security experts in our community, and translate the results into open source code.", 
    "title": "Creating a community around cybersecurity best practices", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "What if you had software that tracked location history so well it could remember all the walks you take, all your commutes, and even the quests you take in your favorite video games? With this level of detail captured and a bit of algorithmic brilliance, NuPIC allows for instant anomaly detection, and in the process, opens up a whole new world of intelligent applications for pattern recognition.", 
    "author": "Matthew Taylor (Numenta)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41265", 
    "raw_description": "Presented by Matthew Taylor (Numenta). What if you had software that tracked location history so well it could remember all the walks you take, all your commutes, and even the quests you take in your favorite video games? With this level of detail captured and a bit of algorithmic brilliance, NuPIC allows for instant anomaly detection, and in the process, opens up a whole new world of intelligent applications for pattern recognition.", 
    "title": "Anomaly detection with NuPIC", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Changing the engine that runs a large PHP application is fraught with hidden dangers but comes with large rewards. In this talk, I'll detail the process Box went through to safely make the transition to running our production site on top of HHVM.", 
    "author": "Joe Marrama (Box)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41674", 
    "raw_description": "Presented by Joe Marrama (Box). Changing the engine that runs a large PHP application is fraught with hidden dangers but comes with large rewards. In this talk, I'll detail the process Box went through to safely make the transition to running our production site on top of HHVM.", 
    "title": "Migrating PHP runtimes to HHVM: Taking the plunge", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "As we become more and more reliant on our computers, attackers become more and more sophisticated. How can we build a computer that's resilient to some of the more subtle attacks such as firmware modification?", 
    "author": "Matthew Garrett (CoreOS)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41536", 
    "raw_description": "Presented by Matthew Garrett (CoreOS). As we become more and more reliant on our computers, attackers become more and more sophisticated. How can we build a computer that's resilient to some of the more subtle attacks such as firmware modification?", 
    "title": "Building a trustworthy computer", 
    "room": "D139/140"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Reactive Applications are the next major evolution of the Internet. They allow for applications to be responsive, scalable and resilient by building on a fully event-driven foundation. Typesafe’s Reactive Platform, consisting of the Play Framework, the Akka middleware and the Scala programming language embraces this new programming paradigm.", 
    "author": "Henrik Engstrom (Typesafe)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42543", 
    "raw_description": "Presented by Henrik Engstrom (Typesafe). Reactive Applications are the next major evolution of the Internet. They allow for applications to be responsive, scalable and resilient by building on a fully event-driven foundation. Typesafe’s Reactive Platform, consisting of the Play Framework, the Akka middleware and the Scala programming language embraces this new programming paradigm.", 
    "title": "Reactive Architecture with Play, Akka, and Scala", 
    "room": "E143/144"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "The open source world has a vibrant, never-ending calendar of community events. This session will cover best practices and pitfalls to avoid in planning and executing events for your technical community.", 
    "author": "Kara Sowles (Puppet Labs), Francesca Krihely (MongoDB )", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41698", 
    "raw_description": "Presented by Kara Sowles (Puppet Labs), Francesca Krihely (MongoDB ). The open source world has a vibrant, never-ending calendar of community events. This session will cover best practices and pitfalls to avoid in planning and executing events for your technical community.", 
    "title": "Introduction to planning and running tech events", 
    "room": "E143/144"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Perl 6 is a new multiparadigm language, in which you can easily combine functional, procedural, declarative, OO, and concurrent constructs, even within a single subroutine, without losing readability or efficiency. This class explores some of the most interesting multi-paradigm features of Perl 6, using familiar real-world examples stolen from every Programming 101 class you've ever taken.", 
    "author": "Damian Conway (Thoughtstream)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40630", 
    "raw_description": "Presented by Damian Conway (Thoughtstream). Perl 6 is a new multiparadigm language, in which you can easily combine functional, procedural, declarative, OO, and concurrent constructs, even within a single subroutine, without losing readability or efficiency. This class explores some of the most interesting multi-paradigm features of Perl 6, using familiar real-world examples stolen from every Programming 101 class you've ever taken.", 
    "title": "Perl 6: Transparadigm programming 101", 
    "room": "E143/144"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "This tutorial will enable you to understand and improve the performance of your Go programs. We will do a deep dive into Go's powerful profiling and benchmarking tools, and discuss basic and advanced optimization techniques.", 
    "author": "Josh Bleecher Snyder (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42668", 
    "raw_description": "Presented by Josh Bleecher Snyder (PayPal). This tutorial will enable you to understand and improve the performance of your Go programs. We will do a deep dive into Go's powerful profiling and benchmarking tools, and discuss basic and advanced optimization techniques.", 
    "title": "Go performance tutorial", 
    "room": "E143/144"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "Everything we do in technology - operating systems, applications, systems administration - is based on nothing solid and real, but rather conceptualizations and ideas that we make accessible through metaphors. In fact, far from being \"non-creative,\" nerd-types may be among the most creative storytellers in history.", 
    "author": "Brian Proffitt (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41464", 
    "raw_description": "Presented by Brian Proffitt (Red Hat). Everything we do in technology - operating systems, applications, systems administration - is based on nothing solid and real, but rather conceptualizations and ideas that we make accessible through metaphors. In fact, far from being \"non-creative,\" nerd-types may be among the most creative storytellers in history.", 
    "title": "It's metaphors all the way down", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "The historical versioning of maps defines some of the most fascinating social, political, and environmental flux of precedent. Everything from the eruption of post-World Cup tweets, to the migration patterns of mammals, can be mapped with OSS. This talk will cover time travel as it can be viewed in visualizations: the ways we partner time-series data with interactive maps @CartoDB.", 
    "author": "Aurelia Moser (CartoDB)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42428", 
    "raw_description": "Presented by Aurelia Moser (CartoDB). The historical versioning of maps defines some of the most fascinating social, political, and environmental flux of precedent. Everything from the eruption of post-World Cup tweets, to the migration patterns of mammals, can be mapped with OSS. This talk will cover time travel as it can be viewed in visualizations: the ways we partner time-series data with interactive maps @CartoDB.", 
    "title": "Visualizing flux: Time travel, torque, and temporal maps", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Scala plays a central role in many parts of Twitter's infrastructure, and Twitter's open source projects are widely used in the Scala community. While Scala has brought many benefits to Twitter, its nature as a relatively young hybrid OOP / FP language has also posed some challenges. This talk will provide an overview of how Twitter maintains one of the largest Scala codebases on the planet.", 
    "author": "Travis Brown (Twitter, Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42332", 
    "raw_description": "Presented by Travis Brown (Twitter, Inc.). Scala plays a central role in many parts of Twitter's infrastructure, and Twitter's open source projects are widely used in the Scala community. While Scala has brought many benefits to Twitter, its nature as a relatively young hybrid OOP / FP language has also posed some challenges. This talk will provide an overview of how Twitter maintains one of the largest Scala codebases on the planet.", 
    "title": "Scala at scale at Twitter", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "Open source isn't open source without a license. GitHub is the de facto hub for creating and sharing open source software, but how much of it is truly open? How has license usage changed over time? How does licensing effect contribution, reuse, and project evolution? Join Ben Balter and Tal Niv, two of GitHub's legals for a quantitative analysis of license usage across all of GitHub's 19M repos.", 
    "author": "Ben Balter (GitHub, Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41781", 
    "raw_description": "Presented by Ben Balter (GitHub, Inc.). Open source isn't open source without a license. GitHub is the de facto hub for creating and sharing open source software, but how much of it is truly open? How has license usage changed over time? How does licensing effect contribution, reuse, and project evolution? Join Ben Balter and Tal Niv, two of GitHub's legals for a quantitative analysis of license usage across all of GitHub's 19M repos.", 
    "title": "Open source licensing on GitHub by the numbers", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Do you need to build a recommendation engine like yesterday and have no idea where to start? How to get over the cold start problem? How to get some initial data? How do you know if its even working? Learn how to get past all that and get up and recommending quickly.", 
    "author": "Max De Marzi (NeoTechnology)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41632", 
    "raw_description": "Presented by Max De Marzi (NeoTechnology). Do you need to build a recommendation engine like yesterday and have no idea where to start? How to get over the cold start problem? How to get some initial data? How do you know if its even working? Learn how to get past all that and get up and recommending quickly.", 
    "title": "Bootstrapping a recommendation engine", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "As open source has become mainstream and a business, many companies face a knowledge gap and may not even realize it: most executives and sales managers have no particular experience in the dynamics of open source. Unfortunately, most open source folks have no experience in sales either! This session will help each group to understand, and apply, both the open source and sales parts together.", 
    "author": "Henrik Ingo (MongoDB)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40359", 
    "raw_description": "Presented by Henrik Ingo (MongoDB). As open source has become mainstream and a business, many companies face a knowledge gap and may not even realize it: most executives and sales managers have no particular experience in the dynamics of open source. Unfortunately, most open source folks have no experience in sales either! This session will help each group to understand, and apply, both the open source and sales parts together.", 
    "title": "Selling open source 101", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "2015 is an exciting year for PHP. With PHP 7 soon to be released, and HHVM getting complete enough to run most existing PHP apps well, you have two amazingly fast options for running your PHP code. In this session I will cover the performance and new features of PHP 7.", 
    "author": "Rasmus Lerdorf (Etsy)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41269", 
    "raw_description": "Presented by Rasmus Lerdorf (Etsy). 2015 is an exciting year for PHP. With PHP 7 soon to be released, and HHVM getting complete enough to run most existing PHP apps well, you have two amazingly fast options for running your PHP code. In this session I will cover the performance and new features of PHP 7.", 
    "title": "Speeding up the web with PHP 7", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "Our personal identity is core to how we perceive ourselves and wish to be seen. All too often, however, applications, databases, and user interfaces are not designed to fully support the worldwide diversity of our most basic personal information like names and genders. This session will demonstrate ways to build applications that respect users’ identities instead of limiting them.", 
    "author": "Nova Patch (Shutterstock)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41305", 
    "raw_description": "Presented by Nova Patch (Shutterstock). Our personal identity is core to how we perceive ourselves and wish to be seen. All too often, however, applications, databases, and user interfaces are not designed to fully support the worldwide diversity of our most basic personal information like names and genders. This session will demonstrate ways to build applications that respect users’ identities instead of limiting them.", 
    "title": "Hello, my name is __________.", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "Are we responsible for what code is used for once released? Security tools are a fascinating grey area. In order to protect our organisations, systems, and people, we must attack them in controlled ways and measure the results. The line between beneficial defensive tools and weapon of choice is unclear. So how do you safely open source a security tool like this? Let me share my story.", 
    "author": "Laura Bell (SafeStack Limited)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40511", 
    "raw_description": "Presented by Laura Bell (SafeStack Limited). Are we responsible for what code is used for once released? Security tools are a fascinating grey area. In order to protect our organisations, systems, and people, we must attack them in controlled ways and measure the results. The line between beneficial defensive tools and weapon of choice is unclear. So how do you safely open source a security tool like this? Let me share my story.", 
    "title": "For the greater good? Open sourcing weaponisable code", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "The Internet of Things has begun to emerge, and the Age of Robots has come upon us. What are the technologies that will make it real? The new and powerful programming language Go is ideally suited for the task. In this talk, we will share our vision of \"full stack robotics\" based on open source software such as Gobot, with live demonstrations of actual robotic devices.", 
    "author": "Ron Evans (The Hybrid Group), Adrian Zankich (The Hybrid Group)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43709", 
    "raw_description": "Presented by Ron Evans (The Hybrid Group), Adrian Zankich (The Hybrid Group). The Internet of Things has begun to emerge, and the Age of Robots has come upon us. What are the technologies that will make it real? The new and powerful programming language Go is ideally suited for the task. In this talk, we will share our vision of \"full stack robotics\" based on open source software such as Gobot, with live demonstrations of actual robotic devices.", 
    "title": "Full stack robotics using Go", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "Open source your job search and career. Open source finding and hiring candidates. Open source the talent pool.", 
    "author": "Kyle Simpson (Getify Solutions)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41188", 
    "raw_description": "Presented by Kyle Simpson (Getify Solutions). Open source your job search and career. Open source finding and hiring candidates. Open source the talent pool.", 
    "title": "Open source working", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "Many conference attendees come year after year without giving presentations.  The sense that there's a high bar for perfection is pervasive, and people are afraid of being \"wrong.\"  Everyone has a story to tell about a problem they've solved or issues they've tackled.  Learn how to share your experiences without fear, and join the speaker community!", 
    "author": "Kirsten Hunter (Akamai)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41197", 
    "raw_description": "Presented by Kirsten Hunter (Akamai). Many conference attendees come year after year without giving presentations.  The sense that there's a high bar for perfection is pervasive, and people are afraid of being \"wrong.\"  Everyone has a story to tell about a problem they've solved or issues they've tackled.  Learn how to share your experiences without fear, and join the speaker community!", 
    "title": "Telling your story: Speaking for non-speakers", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Without firsthand experience, it is difficult to understand the barriers that exist for screenreader users on the web. Many developers have told me they were curious to \"see\" a screenreader in action. This is your chance! Using a combination of real-world examples and code snippets, we will use a screenreader to go through common barriers and discuss them.", 
    "author": "Nicolas Steenhout (Part of a Whole)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41206", 
    "raw_description": "Presented by Nicolas Steenhout (Part of a Whole). Without firsthand experience, it is difficult to understand the barriers that exist for screenreader users on the web. Many developers have told me they were curious to \"see\" a screenreader in action. This is your chance! Using a combination of real-world examples and code snippets, we will use a screenreader to go through common barriers and discuss them.", 
    "title": "Listen to the difference: Using a screenreader to compare before/after code of 5 top accessibility barriers", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "Conflict can be constructive. Testing ideas by challenging them with alternatives is a useful process. But it can be uncomfortable and confronting for many people. Let's discuss how we can build a culture of respect to embrace the positive aspects of conflict and work together better.", 
    "author": "Donna Benjamin (Creative Contingencies), Gina Likins (Red Hat)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41513", 
    "raw_description": "Presented by Donna Benjamin (Creative Contingencies), Gina Likins (Red Hat). Conflict can be constructive. Testing ideas by challenging them with alternatives is a useful process. But it can be uncomfortable and confronting for many people. Let's discuss how we can build a culture of respect to embrace the positive aspects of conflict and work together better.", 
    "title": "Constructive conflict resolution", 
    "room": "E145"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Over the past decade Damian Conway's popular \"Presentation Aikido\" class has explained and demonstrated the fundamentals of giving great presentations. In this, the long-awaited followup class, Damian delves even deeper into the art and science of presentation, revealing the subtle and unexpected techniques that can lift your presentations from great to extraordinary.", 
    "author": "Damian Conway (Thoughtstream)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/40629", 
    "raw_description": "Presented by Damian Conway (Thoughtstream). Over the past decade Damian Conway's popular \"Presentation Aikido\" class has explained and demonstrated the fundamentals of giving great presentations. In this, the long-awaited followup class, Damian delves even deeper into the art and science of presentation, revealing the subtle and unexpected techniques that can lift your presentations from great to extraordinary.", 
    "title": "Presentation Ninjutsu", 
    "room": "E145/146"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "AngularJS is relatively new, meteorically popular, and functionally powerful. However, a lot of AngularJS’s workings are very opaque and confusing. In this tutorial, an updated version of the same tutorial from last year, my goal is to walk you through building a basic app, and introduce you to concepts and patterns that will allow you to comfortably dive further into using AngularJS.", 
    "author": "Sam Helman (Flatiron Health)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42547", 
    "raw_description": "Presented by Sam Helman (Flatiron Health). AngularJS is relatively new, meteorically popular, and functionally powerful. However, a lot of AngularJS’s workings are very opaque and confusing. In this tutorial, an updated version of the same tutorial from last year, my goal is to walk you through building a basic app, and introduce you to concepts and patterns that will allow you to comfortably dive further into using AngularJS.", 
    "title": "AngularJS tutorial", 
    "room": "E145/146"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Attendees will learn general best practices for cryptography and key management, be able to generate, store, and verify passwords, protect data at rest with encryption, protect data from modification with signing and verification techniques, and generate, store, and use keys securely.", 
    "author": "Jarret Raim (Rackspace), Andrew Hartnett (Rackspace)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41322", 
    "raw_description": "Presented by Jarret Raim (Rackspace), Andrew Hartnett (Rackspace). Attendees will learn general best practices for cryptography and key management, be able to generate, store, and verify passwords, protect data at rest with encryption, protect data from modification with signing and verification techniques, and generate, store, and use keys securely.", 
    "title": "Stop building insecure systems: Cryptography 101", 
    "room": "E145/146"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "In this three-hour Cassandra tutorial, we’ll explore all the basics you’ll need to become best buds with this radically scalable, always-on, and increasingly popular database solution.", 
    "author": "Dani Traphagen (DataStax), Jon Haddad (DataStax)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41150", 
    "raw_description": "Presented by Dani Traphagen (DataStax), Jon Haddad (DataStax). In this three-hour Cassandra tutorial, we’ll explore all the basics you’ll need to become best buds with this radically scalable, always-on, and increasingly popular database solution.", 
    "title": "Becoming friends with Cassandra", 
    "room": "E145/146"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "2014 was a hard year for open source software when it comes to security vulnerabilities.  There were great amounts of attention focused on Heartbleed, ShellShock, BERserk, etc.  Was that attention well founded?  This presentation intends to find out.", 
    "author": "Constanza Heath (Intel)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41708", 
    "raw_description": "Presented by Constanza Heath (Intel). 2014 was a hard year for open source software when it comes to security vulnerabilities.  There were great amounts of attention focused on Heartbleed, ShellShock, BERserk, etc.  Was that attention well founded?  This presentation intends to find out.", 
    "title": "How my POODLE lost his Xen state by seeing a Ghost, going BERserk, and getting ShellShock with a Heartbleed", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Maturing engineering organizations tend to coalesce into silos around products, technologies, and business units. InnerSource uses proven open source approaches for development inside the firewall, bypassing the constraints of silo architecture while increasing velocity and quality. This session will examine how InnerSource is growing at PayPal and what has been learned so far.", 
    "author": "Cedric Williams (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41838", 
    "raw_description": "Presented by Cedric Williams (PayPal). Maturing engineering organizations tend to coalesce into silos around products, technologies, and business units. InnerSource uses proven open source approaches for development inside the firewall, bypassing the constraints of silo architecture while increasing velocity and quality. This session will examine how InnerSource is growing at PayPal and what has been learned so far.", 
    "title": "InnerSource as the anti-silo: How open source style has broken silos while strengthening systems at PayPal", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Ever wonder how Watson beat all comers in Jeopardy or how Siri or Google Now work?  Thinking about deploying question answering (QA) technology in your application?  QA and NLP technology have finally hit the mainstream, and are making information access more powerful every day.  The best part?  Open source technologies make it easier than ever to build and deploy question answering technology!", 
    "author": "Grant Ingersoll (Lucidworks)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41487", 
    "raw_description": "Presented by Grant Ingersoll (Lucidworks). Ever wonder how Watson beat all comers in Jeopardy or how Siri or Google Now work?  Thinking about deploying question answering (QA) technology in your application?  QA and NLP technology have finally hit the mainstream, and are making information access more powerful every day.  The best part?  Open source technologies make it easier than ever to build and deploy question answering technology!", 
    "title": "You've got questions, we've got answers!", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "It is not in your best interest to leave most of your work hidden away at your employer. GitHub has created a showcase for your work, and hiring managers will spend time looking through your work before you are invited to come in for an interview. I will cover strategies for increasing both the quality and quantity of your open source contributions to improve your open resume.", 
    "author": "Mark Ferree (Chapter Three)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42186", 
    "raw_description": "Presented by Mark Ferree (Chapter Three). It is not in your best interest to leave most of your work hidden away at your employer. GitHub has created a showcase for your work, and hiring managers will spend time looking through your work before you are invited to come in for an interview. I will cover strategies for increasing both the quality and quantity of your open source contributions to improve your open resume.", 
    "title": "Building your open resume", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Unicode is much more than just characters. The Unicode Consortium defines open standards for collating, parsing, and formatting data in much of the world’s languages. The Common Locale Data Repository (CLDR) is the largest standard repository of locale data along with specifications for its use, and is a powerful resource for software localization.", 
    "author": "Nova Patch (Shutterstock)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41337", 
    "raw_description": "Presented by Nova Patch (Shutterstock). Unicode is much more than just characters. The Unicode Consortium defines open standards for collating, parsing, and formatting data in much of the world’s languages. The Common Locale Data Repository (CLDR) is the largest standard repository of locale data along with specifications for its use, and is a powerful resource for software localization.", 
    "title": "Unicode beyond just characters: Localization with the CLDR", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "The HP Advanced Technology Group recently created a proof of concept to build CoreOS components - Docker, Fleet, and Etcd - on top of Debian, using Ansible and HP Cloud Virtual Machines to demonstrate the power and flexibility of a clustered Docker architecture. This talk will cover how our team built this proof of concept and show a ELK Stack demonstration application running on the cluster.", 
    "author": "Patrick Galbraith (Hewlett Packard)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41659", 
    "raw_description": "Presented by Patrick Galbraith (Hewlett Packard). The HP Advanced Technology Group recently created a proof of concept to build CoreOS components - Docker, Fleet, and Etcd - on top of Debian, using Ansible and HP Cloud Virtual Machines to demonstrate the power and flexibility of a clustered Docker architecture. This talk will cover how our team built this proof of concept and show a ELK Stack demonstration application running on the cluster.", 
    "title": "CoreOS DNA on Debian", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "When designers and developers work together from the start, it produces better outcomes, more usable products, and increased adoption. But how can we get designers involved and wanting to participate in the open source community? In order to figure out how to fix it, we need to take a look at the barriers for designers and how we can work together to influence change.", 
    "author": "Una Kravets (IBM Design)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41431", 
    "raw_description": "Presented by Una Kravets (IBM Design). When designers and developers work together from the start, it produces better outcomes, more usable products, and increased adoption. But how can we get designers involved and wanting to participate in the open source community? In order to figure out how to fix it, we need to take a look at the barriers for designers and how we can work together to influence change.", 
    "title": "Open source design: A love story", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "ASP.Net vNext, the open source version of the .Net series, has opened up its framework to an entirely new web developer community.  The cool thing about this lean framework is you can get ASP.NET from Mac to PC using either Visual Studio Community or Sublime. In this demo, I will be going through the tools and frameworks you need to get ASP.NET vNext running on OS X Yosemite.", 
    "author": "Maria Naggaga (Microsoft )", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41777", 
    "raw_description": "Presented by Maria Naggaga (Microsoft ). ASP.Net vNext, the open source version of the .Net series, has opened up its framework to an entirely new web developer community.  The cool thing about this lean framework is you can get ASP.NET from Mac to PC using either Visual Studio Community or Sublime. In this demo, I will be going through the tools and frameworks you need to get ASP.NET vNext running on OS X Yosemite.", 
    "title": "Asp.net vNext: Hey, Asp.net isn't just for enterprise", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "While leading several high-profile open source projects, Joyent has also historically had significant proprietary systems.  In November of last year, we open sourced these proprietary systems -- including our SmartDataCenter cloud orchestration system and our Manta scale-out storage system -- becoming an all open source company.", 
    "author": "Bryan Cantrill (Joyent)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41809", 
    "raw_description": "Presented by Bryan Cantrill (Joyent). While leading several high-profile open source projects, Joyent has also historically had significant proprietary systems.  In November of last year, we open sourced these proprietary systems -- including our SmartDataCenter cloud orchestration system and our Manta scale-out storage system -- becoming an all open source company.", 
    "title": "Leaping the chasm from proprietary to open:  A survivor's guide", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "In the next decade, data-driven feeds will become the primary tool with which we manage our lives. Access to that data—much of which lives behind walled gardens, or profitable arbitrage—is fast becoming a moral issue. In this session, Alistair Croll looks at the promises and perils of big data as it finds its way into our lives, and makes far too many unreasonable predictions along the way.", 
    "author": "Alistair Croll (Solve For Interesting)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42462", 
    "raw_description": "Presented by Alistair Croll (Solve For Interesting). In the next decade, data-driven feeds will become the primary tool with which we manage our lives. Access to that data—much of which lives behind walled gardens, or profitable arbitrage—is fast becoming a moral issue. In this session, Alistair Croll looks at the promises and perils of big data as it finds its way into our lives, and makes far too many unreasonable predictions along the way.", 
    "title": "Nobody should know more about you than you do", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "The Internet of Things is built on open source software, and yet the devices are far from open. This isn’t the future that free and open source contributors have been working toward. It's a disappointment for the Open Source Community, but we can lead the way to freedom, transparency, and collaboration in IoT. And we must—to avert impending frustration for increasingly savvy consumers.", 
    "author": "Peter Hoddie (Marvell)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44890", 
    "raw_description": "Presented by Peter Hoddie (Marvell). The Internet of Things is built on open source software, and yet the devices are far from open. This isn’t the future that free and open source contributors have been working toward. It's a disappointment for the Open Source Community, but we can lead the way to freedom, transparency, and collaboration in IoT. And we must—to avert impending frustration for increasingly savvy consumers.", 
    "title": "Closed devices powered by open source software? The IoT Paradox.", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "The pull request is both a feature and a philosophy--it takes a stand on openness, collaboration and culture. While most PR use cases are straightforward, other novel uses offer deeper learning opportunities. We’ll walk through different ways to deploy pull requests to model the values of open source, share understanding, learn from mistakes, and build a community of practice.", 
    "author": "Peter Bell (Ronin Labs)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42489", 
    "raw_description": "Presented by Peter Bell (Ronin Labs). The pull request is both a feature and a philosophy--it takes a stand on openness, collaboration and culture. While most PR use cases are straightforward, other novel uses offer deeper learning opportunities. We’ll walk through different ways to deploy pull requests to model the values of open source, share understanding, learn from mistakes, and build a community of practice.", 
    "title": "Build a community of practice, one PR at a time: Using GitHub to teach the values of open source", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Mocha.jl is an efficient and flexible deep learning framework for Julia. It supports multiple computation backends, leading to 20~30 times faster training on a modern GPU device. We will use an example to illustrate the user interfaces of Mocha.jl and also introduce the design and architecture behind the library implementations.", 
    "author": "Chiyuan Zhang (MIT)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41956", 
    "raw_description": "Presented by Chiyuan Zhang (MIT). Mocha.jl is an efficient and flexible deep learning framework for Julia. It supports multiple computation backends, leading to 20~30 times faster training on a modern GPU device. We will use an example to illustrate the user interfaces of Mocha.jl and also introduce the design and architecture behind the library implementations.", 
    "title": "Mocha.jl - Deep learning for Julia", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "Join the authors of \"The Kerbal Book\" on a panel where they regale you with tales of their adventures in the Kerbal Space Program, the increasingly popular and disturbingly realistic space programme simulator game enjoyed by geeks around the world. Learn how and why you should go to space, and what you can learn from it! Science will be involved.", 
    "author": "Alasdair Allan (Babilim Light Industries), Paul Fenwick (Perl Training Australia), Jonathon Manning (Secret Lab Pty. Ltd.), Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41535", 
    "raw_description": "Presented by Alasdair Allan (Babilim Light Industries), Paul Fenwick (Perl Training Australia), Jonathon Manning (Secret Lab Pty. Ltd.), Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee). Join the authors of \"The Kerbal Book\" on a panel where they regale you with tales of their adventures in the Kerbal Space Program, the increasingly popular and disturbingly realistic space programme simulator game enjoyed by geeks around the world. Learn how and why you should go to space, and what you can learn from it! Science will be involved.", 
    "title": "The Mün and back - a Kerbal tale", 
    "room": "E146"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "You might be good at designing coasters in \"Roller Coaster Tycoon,\" but you could make even cooler coasters if you let Go build them for you. We'll look a little at RCT's code (written in x86) and how to reverse-engineer it. You'll learn how to design good genetic algorithms. Finally, we'll discuss the advantages of using Go's standard library for a project like this.", 
    "author": "Kevin Burke (Shyp)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41183", 
    "raw_description": "Presented by Kevin Burke (Shyp). You might be good at designing coasters in \"Roller Coaster Tycoon,\" but you could make even cooler coasters if you let Go build them for you. We'll look a little at RCT's code (written in x86) and how to reverse-engineer it. You'll learn how to design good genetic algorithms. Finally, we'll discuss the advantages of using Go's standard library for a project like this.", 
    "title": "Hacking \"Roller Coaster Tycoon\" with genetic algorithms and Go", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Learn about how floating-point arithmetic approximates real arithmetic, and lessons for more effective (and less surprising) numerical programming.", 
    "author": "Joe Darcy (Oracle)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42013", 
    "raw_description": "Presented by Joe Darcy (Oracle). Learn about how floating-point arithmetic approximates real arithmetic, and lessons for more effective (and less surprising) numerical programming.", 
    "title": "What every programmer should know about floating-point arithmetic", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "An open, interoperable communication ecosystem for VoIP, IM, and IoT services currently feels farther away than ever. Users are forced into closed silos like WhatsApp and Facebook by their contacts, rather than choosing their preferred app/service. This talk discusses ways to fix the problem and introduces Matrix: an open standard for decentralised communication, which may provide a new hope.", 
    "author": "Matthew Hodgson (Matrix.org)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42389", 
    "raw_description": "Presented by Matthew Hodgson (Matrix.org). An open, interoperable communication ecosystem for VoIP, IM, and IoT services currently feels farther away than ever. Users are forced into closed silos like WhatsApp and Facebook by their contacts, rather than choosing their preferred app/service. This talk discusses ways to fix the problem and introduces Matrix: an open standard for decentralised communication, which may provide a new hope.", 
    "title": "Fixing the fragmentation problem for real-time communications.", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "card.io scans credit cards using your phone's camera. It was recently open-sourced. This talk will explain how card.io works its magic. No computer vision or machine learning background required.", 
    "author": "Josh Bleecher Snyder (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42675", 
    "raw_description": "Presented by Josh Bleecher Snyder (PayPal). card.io scans credit cards using your phone's camera. It was recently open-sourced. This talk will explain how card.io works its magic. No computer vision or machine learning background required.", 
    "title": "Practical mobile computer vision: How card.io works", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "The FSF turns 30 this October. Don your freedom goggles and trip with its beardless executive director through 30 years of entertaining memorabilia and historical happenings (including \"Who's this 'open source' kid and why's he on my lawn?\"), then emerge, blinking, in the present. What are the challenges for user freedom in the next 30 years and how do we build a united movement to tackle them?", 
    "author": "John Sullivan (Free Software Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42319", 
    "raw_description": "Presented by John Sullivan (Free Software Foundation). The FSF turns 30 this October. Don your freedom goggles and trip with its beardless executive director through 30 years of entertaining memorabilia and historical happenings (including \"Who's this 'open source' kid and why's he on my lawn?\"), then emerge, blinking, in the present. What are the challenges for user freedom in the next 30 years and how do we build a united movement to tackle them?", 
    "title": "The Free Software Foundation, on the road for 30 years: Are we there yet, RMS?", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Bluetooth LE is very different from classic Bluetooth, in fact pretty much the only thing that is the same is the name. Using Bluetooth LE radios properly involves creating custom services and characteristics. However, until recently, this was actually really hard to do without making use of expensive proprietary software tools.", 
    "author": "Alasdair Allan (Babilim Light Industries)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41412", 
    "raw_description": "Presented by Alasdair Allan (Babilim Light Industries). Bluetooth LE is very different from classic Bluetooth, in fact pretty much the only thing that is the same is the name. Using Bluetooth LE radios properly involves creating custom services and characteristics. However, until recently, this was actually really hard to do without making use of expensive proprietary software tools.", 
    "title": "Creating Bluetooth LE devices with Arduino", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "The real magic in any community comes from the people. I will show you tools and techniques for performing network analysis, to look at the people in your community along with the relationships between them. Why settle for boring numbers and line charts to describe your community when you can do cool visualizations that show how people connect within your open source community?", 
    "author": "Dawn Foster (University of Greenwich)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41617", 
    "raw_description": "Presented by Dawn Foster (University of Greenwich). The real magic in any community comes from the people. I will show you tools and techniques for performing network analysis, to look at the people in your community along with the relationships between them. Why settle for boring numbers and line charts to describe your community when you can do cool visualizations that show how people connect within your open source community?", 
    "title": "Network analysis: People and open source communities", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "The way math equations are written and represented have a long history that's woven into computer science. However, rendering math for the web has been a challenge. This talk explores the pursuit of rendering math beautifully for the web, culminating in the creation of a library that integrates with markup formats like Markdown and AsciiDoc.", 
    "author": "Garen Torikian (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41724", 
    "raw_description": "Presented by Garen Torikian (GitHub). The way math equations are written and represented have a long history that's woven into computer science. However, rendering math for the web has been a challenge. This talk explores the pursuit of rendering math beautifully for the web, culminating in the creation of a library that integrates with markup formats like Markdown and AsciiDoc.", 
    "title": "A brief history of rendering math (and its future online)", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "Learn how digital signal processing can help you look at data, and even the world around you, with a new critical eye. Gain an understanding of the methods behind speech recognition, image manipulation, data compression, and more.", 
    "author": "Amy Boyle (New Relic)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41611", 
    "raw_description": "Presented by Amy Boyle (New Relic). Learn how digital signal processing can help you look at data, and even the world around you, with a new critical eye. Gain an understanding of the methods behind speech recognition, image manipulation, data compression, and more.", 
    "title": "Data transformation superpowers with digital signal processing", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "Results of a five-year study on open source development and security practices form the basis for introducing supply chain management to your development practice. We rely on the usage of third-party components, and take on the responsibility for them and their licensing terms or security vulnerabilities. New tools for managing these components in your software development efforts are demoed.", 
    "author": "Manfred Moser (simpligility technologies inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41388", 
    "raw_description": "Presented by Manfred Moser (simpligility technologies inc.). Results of a five-year study on open source development and security practices form the basis for introducing supply chain management to your development practice. We rely on the usage of third-party components, and take on the responsibility for them and their licensing terms or security vulnerabilities. New tools for managing these components in your software development efforts are demoed.", 
    "title": "Getting your ducks in a row - an introduction to managing components in your software supply chain", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "This talk addresses improving the ability of hierarchal temporal memory (HTM) to predict electricity demand, helping the algorithm by providing some of the complementarity data streams currently applied to demand analysis, and including some goodness-of-fit metrics that address known characteristics of electric load.", 
    "author": "Patrick Barton (O'Reilly School of Technology)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41508", 
    "raw_description": "Presented by Patrick Barton (O'Reilly School of Technology). This talk addresses improving the ability of hierarchal temporal memory (HTM) to predict electricity demand, helping the algorithm by providing some of the complementarity data streams currently applied to demand analysis, and including some goodness-of-fit metrics that address known characteristics of electric load.", 
    "title": "Applications of hierarchal temporal memory algorithm tools to energy demand analysis", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-23 17:00:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "This talk aims to discuss the current state of online harassment, and the way that the open source community can create new tools to mitigate abuse until policy and law enforcement catch up.", 
    "author": "Randi Harper (Literally Blue, LLC)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42112", 
    "raw_description": "Presented by Randi Harper (Literally Blue, LLC). This talk aims to discuss the current state of online harassment, and the way that the open source community can create new tools to mitigate abuse until policy and law enforcement catch up.", 
    "title": "Open sourcing anti-harassment tools", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-24 10:00:00-07:00", 
    "end": "2015-07-24 10:40:00-07:00", 
    "description": "Kallithea is a self-hosted source code management system that exists thanks to a GPL violation and subsequent compliance action by the Software Freedom Conservancy.  We'll show how a copyleft license violation and careful license vetting helped a software development community begin anew, and why licensing wonks and release engineers can make a huge impact on the health of a project's community.", 
    "author": "Bradley Kuhn (Software Freedom Conservancy)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42015", 
    "raw_description": "Presented by Bradley Kuhn (Software Freedom Conservancy). Kallithea is a self-hosted source code management system that exists thanks to a GPL violation and subsequent compliance action by the Software Freedom Conservancy.  We'll show how a copyleft license violation and careful license vetting helped a software development community begin anew, and why licensing wonks and release engineers can make a huge impact on the health of a project's community.", 
    "title": "When copyleft business models go bad ... and how Kallithea's community recovered", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-24 11:10:00-07:00", 
    "end": "2015-07-24 11:50:00-07:00", 
    "description": "Internet Archive has released a number of open APIs and tools to allow people to upload and download items, as well as data mine the metadata for its entire 12+ Petabyte collection.", 
    "author": "VM Brasseur (@vmbrasseur), Alexis Rossi (Internet Archive)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41182", 
    "raw_description": "Presented by VM Brasseur (@vmbrasseur), Alexis Rossi (Internet Archive). Internet Archive has released a number of open APIs and tools to allow people to upload and download items, as well as data mine the metadata for its entire 12+ Petabyte collection.", 
    "title": "Internet archive: Universal access. Open APIs", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "Elixir is a functional programming language with a familiar syntax.  In this tutorial we’ll explore the basics of the language, and why you want to use Elixir to write concurrent, scalable, and robust programs.", 
    "author": "Marc Sugiyama (Erlang Solutions, Inc)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41752", 
    "raw_description": "Presented by Marc Sugiyama (Erlang Solutions, Inc). Elixir is a functional programming language with a familiar syntax.  In this tutorial we’ll explore the basics of the language, and why you want to use Elixir to write concurrent, scalable, and robust programs.", 
    "title": "Painlessly functional and concurrent: An introduction to Elixir", 
    "room": "D133"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Erlang is a programming language designed for the internet age, although it predates the web. It is a language designed for multi-core computers, although it predates them too. In this tutorial, Francesco and Garrett will present the features that make Erlang a trendsetter and give you a context for using it as strategic tool in your software arsenal.", 
    "author": "Garrett Smith (CloudBees), Francesco Cesarini (Erlang Solutions Ltd)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42542", 
    "raw_description": "Presented by Garrett Smith (CloudBees), Francesco Cesarini (Erlang Solutions Ltd). Erlang is a programming language designed for the internet age, although it predates the web. It is a language designed for multi-core computers, although it predates them too. In this tutorial, Francesco and Garrett will present the features that make Erlang a trendsetter and give you a context for using it as strategic tool in your software arsenal.", 
    "title": "Erlang: Inspiring software", 
    "room": "D133"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "Are you a PHP beginner or a seasoned veteran upgrading from PHP 4 to PHP 5? Have you read about \"PSR\"s or the PHP-FIG but don't know what they are? Josh Lockhart will introduce you to modern PHP practices and techniques. Learn about namespaces, traits, and generators. Find out how to use, build, and share components. And find out how to continue learning and get involved with your PHP community.", 
    "author": "Josh Lockhart (New Media Campaigns)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42643", 
    "raw_description": "Presented by Josh Lockhart (New Media Campaigns). Are you a PHP beginner or a seasoned veteran upgrading from PHP 4 to PHP 5? Have you read about \"PSR\"s or the PHP-FIG but don't know what they are? Josh Lockhart will introduce you to modern PHP practices and techniques. Learn about namespaces, traits, and generators. Find out how to use, build, and share components. And find out how to continue learning and get involved with your PHP community.", 
    "title": "Introduction to modern PHP", 
    "room": "F150"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "In this workshop, experts from Mesosphere will demonstrate how to operate today’s most popular distributed frameworks on Apache Mesos - from installation, through command line interface, monitoring, and everything in between, in real production scenarios across clustered resources.", 
    "author": "Connor Doyle (Mesosphere.io), Niklas Nielsen (Mesosphere, Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42587", 
    "raw_description": "Presented by Connor Doyle (Mesosphere.io), Niklas Nielsen (Mesosphere, Inc.). In this workshop, experts from Mesosphere will demonstrate how to operate today’s most popular distributed frameworks on Apache Mesos - from installation, through command line interface, monitoring, and everything in between, in real production scenarios across clustered resources.", 
    "title": "How to run the next generation of enterprise “killer apps” on Apache Mesos", 
    "room": "F150"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Open Cloud Day at OSCON will cover the latest innovations in public and private clouds, IaaS, and PaaS platforms. You'll learn from industry practitioners from a variety of platforms, who will share their expertise, and provide you with a vision of where open source in the cloud is heading.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43976", 
    "raw_description": "Open Cloud Day at OSCON will cover the latest innovations in public and private clouds, IaaS, and PaaS platforms. You'll learn from industry practitioners from a variety of platforms, who will share their expertise, and provide you with a vision of where open source in the cloud is heading.", 
    "title": "Open Cloud Day (Sponsored by Booz Allen Hamilton, IBM, Intel and Red Hat)", 
    "room": "F150"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Learn and contribute to modernizing open source messaging. Meet technologists from FastMail, Cyrus IMAP, Atmail, MXTools, OpenIO, and Spamhaus, who are re-booting email with smarter clients, hyper-scale storage grids, secured transport, and high performance virtualization. Discover exciting tools that can be used to develop cool new apps that can interoperate with existing systems and devices.", 
    "author": "Pierre Chamberland (Netmail), Laurent Denel (OpenIO), Matt Technical Advisor (Spamhaus)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45257", 
    "raw_description": "Presented by Pierre Chamberland (Netmail), Laurent Denel (OpenIO), Matt Technical Advisor (Spamhaus). Learn and contribute to modernizing open source messaging. Meet technologists from FastMail, Cyrus IMAP, Atmail, MXTools, OpenIO, and Spamhaus, who are re-booting email with smarter clients, hyper-scale storage grids, secured transport, and high performance virtualization. Discover exciting tools that can be used to develop cool new apps that can interoperate with existing systems and devices.", 
    "title": "Open source email reboot! - Open messaging day", 
    "room": "F151"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 12:30:00-07:00", 
    "description": "This will be a hands-on workshop aimed at those who are casually familiar with the Linux operating system. Perhaps you use it on a server or in a virtualbox, but want to gain deeper understanding about the kernel and how Linux actually works.", 
    "author": "Tammy Butow (DigitalOcean), Georgi Knox (Bitly), Jessica Frazelle (Docker)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41300", 
    "raw_description": "Presented by Tammy Butow (DigitalOcean), Georgi Knox (Bitly), Jessica Frazelle (Docker). This will be a hands-on workshop aimed at those who are casually familiar with the Linux operating system. Perhaps you use it on a server or in a virtualbox, but want to gain deeper understanding about the kernel and how Linux actually works.", 
    "title": "Linux bootcamp: From casual Linux user to kernel hacker", 
    "room": "F151"
  }, 
  {
    "start": "2015-07-20 13:30:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Prototypes allow us to see, touch, feel, and refine ideas and designs. Starting from zero, this hands-on workshop explores smart hardware prototyping using a micro-controller and basic electronic components. You'll connect LEDs, buttons, and knobs, then program a micro-controller to define behavior. Through this you’ll better understand the tools and process of designing smart, connected products.", 
    "author": "Robert Gallup (XOBXOB)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/41609", 
    "raw_description": "Presented by Robert Gallup (XOBXOB). Prototypes allow us to see, touch, feel, and refine ideas and designs. Starting from zero, this hands-on workshop explores smart hardware prototyping using a micro-controller and basic electronic components. You'll connect LEDs, buttons, and knobs, then program a micro-controller to define behavior. Through this you’ll better understand the tools and process of designing smart, connected products.", 
    "title": "Hacking smart electronics", 
    "room": "F151"
  }, 
  {
    "start": "2015-07-21 10:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Experience a first look into the future of container orchestration at the Kubernetes 1.0 Launch. Come and learn about the Kubernetes project, its future, and how real people are using Kubernetes for their applications", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45281", 
    "raw_description": "Experience a first look into the future of container orchestration at the Kubernetes 1.0 Launch. Come and learn about the Kubernetes project, its future, and how real people are using Kubernetes for their applications", 
    "title": "Google Presents: Kubernetes 1.0 launch", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "With 1000's of Cassandra users worldwide, we claim victory on how to keep a distributed database always available. Now it is time to tackle all the smaller problems that help a database go from great to spectacular. Developer productivity, ease of use, and a rich ecosystem are firmly in our target. Let's talk about what has been added and what's coming and why.", 
    "author": "Rachel Pedreschi (DataStax)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44902", 
    "raw_description": "Presented by Rachel Pedreschi (DataStax). With 1000's of Cassandra users worldwide, we claim victory on how to keep a distributed database always available. Now it is time to tackle all the smaller problems that help a database go from great to spectacular. Developer productivity, ease of use, and a rich ecosystem are firmly in our target. Let's talk about what has been added and what's coming and why.", 
    "title": "The cursed oracle: Cassandra's past, present and future", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "This talk takes the audience inside the architectural foundation of a modern cloud native platform.", 
    "author": "Chip Childers (Cloud Foundry Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44957", 
    "raw_description": "Presented by Chip Childers (Cloud Foundry Foundation). This talk takes the audience inside the architectural foundation of a modern cloud native platform.", 
    "title": "The architecture of continuous innovation", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "Recently, Samsung has released various products powered by Tizen, including the NX Camera Series, Z1 Smartphone, Samsung Gear, and SUHD TVs. Tizen is a brand new platform, so developers can easily enter and have a strong presence in the Tizen applications market.", 
    "author": "ChunEon Park (Samsung Electronics)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44961", 
    "raw_description": "Presented by ChunEon Park (Samsung Electronics). Recently, Samsung has released various products powered by Tizen, including the NX Camera Series, Z1 Smartphone, Samsung Gear, and SUHD TVs. Tizen is a brand new platform, so developers can easily enter and have a strong presence in the Tizen applications market.", 
    "title": "\"Unique but fast!\" - Make your Tizen GUI application brilliant", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "IoT.JS is for JavaScript developers who want to write IoT services on small devices. It provides programmable IoT spaces with full JavaScript functionality.", 
    "author": "Kyeongwoon Lee (Samsung Electronics)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44956", 
    "raw_description": "Presented by Kyeongwoon Lee (Samsung Electronics). IoT.JS is for JavaScript developers who want to write IoT services on small devices. It provides programmable IoT spaces with full JavaScript functionality.", 
    "title": "Introduction to IoT.JS", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Mobile web apps shouldn't stop working when there's no network connection. Based on Apache CouchDB, PouchDB is an open source syncing JavaScript database that runs within a web browser. Learn how to use HTML5, PouchDB, IBM Cloudant, and IBM Bluemix to build and deploy offline-first mobile web apps that provide a better, faster user experience both offline and online.", 
    "author": "Bradley Holt (IBM Cloudant)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44969", 
    "raw_description": "Presented by Bradley Holt (IBM Cloudant). Mobile web apps shouldn't stop working when there's no network connection. Based on Apache CouchDB, PouchDB is an open source syncing JavaScript database that runs within a web browser. Learn how to use HTML5, PouchDB, IBM Cloudant, and IBM Bluemix to build and deploy offline-first mobile web apps that provide a better, faster user experience both offline and online.", 
    "title": "Offline-first mobile web apps with PouchDB, IBM Cloudant, and IBM Bluemix", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "Ironic is a modern tool for hardware provisioning. Combining a RESTful API, scalable control plane, and pluggable hardware drivers, Ironic installs operating systems efficiently and repeatably on diverse hardware. We will demonstrate Ironic with Ansible, install, build, and deploy a machine image, and discuss the project's architecture, history, and goals. Deep knowledge is not required.", 
    "author": "Devananda van der Veen (HP Cloud)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45053", 
    "raw_description": "Presented by Devananda van der Veen (HP Cloud). Ironic is a modern tool for hardware provisioning. Combining a RESTful API, scalable control plane, and pluggable hardware drivers, Ironic installs operating systems efficiently and repeatably on diverse hardware. We will demonstrate Ironic with Ansible, install, build, and deploy a machine image, and discuss the project's architecture, history, and goals. Deep knowledge is not required.", 
    "title": "Ironic: A modern approach to hardware provisioning", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "Dan Makoski, VP design, will share how the nation’s largest direct bank is using open source concepts to reinvent products and services, redesign digital experiences, and reimagine commercials – connecting people and money in more meaningful ways. Join Dan for a lively discussion about how Capital One views the intersection of code, creativity, customers, and currency.", 
    "author": "Dan  Makoski  (Capital One)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44966", 
    "raw_description": "Presented by Dan  Makoski  (Capital One). Dan Makoski, VP design, will share how the nation’s largest direct bank is using open source concepts to reinvent products and services, redesign digital experiences, and reimagine commercials – connecting people and money in more meaningful ways. Join Dan for a lively discussion about how Capital One views the intersection of code, creativity, customers, and currency.", 
    "title": "Capital One opens up to open source", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "This is an interactive, informative session for those getting started or wishing to learn more about OpenStack.  Join Chris Cannon from the HP Cloud Team for an overview of OpenStack, and a hands-on introduction to HP Helion OpenStack.", 
    "author": "Christopher Cannon (Hewlett-Packard)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45263", 
    "raw_description": "Presented by Christopher Cannon (Hewlett-Packard). This is an interactive, informative session for those getting started or wishing to learn more about OpenStack.  Join Chris Cannon from the HP Cloud Team for an overview of OpenStack, and a hands-on introduction to HP Helion OpenStack.", 
    "title": "OpenStack basics -- featuring HP Helion OpenStack", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "In this tutorial, we will explore different ways to develop and deploy applications to the cloud via the open source Cloud Foundry and OpenStack environments. This will be a hands-on session where participants will have free access to a Helion cluster for learning and experimentation. The information covered will be applicable to any OpenStack and Cloud Foundry environment.", 
    "author": "Rajeev Pandey (Hewlett-Packard Company), Sujay Maheshwari (HP Helion)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44990", 
    "raw_description": "Presented by Rajeev Pandey (Hewlett-Packard Company), Sujay Maheshwari (HP Helion). In this tutorial, we will explore different ways to develop and deploy applications to the cloud via the open source Cloud Foundry and OpenStack environments. This will be a hands-on session where participants will have free access to a Helion cluster for learning and experimentation. The information covered will be applicable to any OpenStack and Cloud Foundry environment.", 
    "title": "Developing and deploying cloud native apps on Cloud Foundry and OpenStack with HP Helion", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "The landscape of information security has changed significantly over the last few years. Increasing amounts of economic value are directly linked to computer infrastructure, making that infrastructure increasingly interesting as a target for malicious actors, both state and private. In this talk, we'll explore this evolving problem space, and how Rackspace is helping solve problems in this space.", 
    "author": "Jarret Raim (Rackspace), Laurens Van Houtven (Rackspace)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45327", 
    "raw_description": "Presented by Jarret Raim (Rackspace), Laurens Van Houtven (Rackspace). The landscape of information security has changed significantly over the last few years. Increasing amounts of economic value are directly linked to computer infrastructure, making that infrastructure increasingly interesting as a target for malicious actors, both state and private. In this talk, we'll explore this evolving problem space, and how Rackspace is helping solve problems in this space.", 
    "title": "Evolution of information security threats", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "This session will provide a rare opportunity to hear perceptions of the current state of the IT universe and a fresh perspective on corporate engagement with open source, from someone applying more than 35 years of continuous involvement in free software, decades of community leadership, and unique experience guiding open source activities at major corporations.", 
    "author": "Bdale Garbee (HP)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45355", 
    "raw_description": "Presented by Bdale Garbee (HP). This session will provide a rare opportunity to hear perceptions of the current state of the IT universe and a fresh perspective on corporate engagement with open source, from someone applying more than 35 years of continuous involvement in free software, decades of community leadership, and unique experience guiding open source activities at major corporations.", 
    "title": "Open source at HP: A fresh perspective", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 16:50:00-07:00", 
    "description": "Doug Crockford has long been a leader in the JavaScript world. His work for the past couple of years at PayPal has yielded a company-wide shift to Node.js, amongst other changes. Currently his team is working on implementing the latest research into hardening browsers. Team members Aashish Sheshadri and Rohit Harchandani will discuss their early implementation work on this exciting project.", 
    "author": "Rohit Harchandani (PayPal), Aashish Sheshadri (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45715", 
    "raw_description": "Presented by Rohit Harchandani (PayPal), Aashish Sheshadri (PayPal). Doug Crockford has long been a leader in the JavaScript world. His work for the past couple of years at PayPal has yielded a company-wide shift to Node.js, amongst other changes. Currently his team is working on implementing the latest research into hardening browsers. Team members Aashish Sheshadri and Rohit Harchandani will discuss their early implementation work on this exciting project.", 
    "title": "Let's talk about browser hardening...", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "GitHub is a large and fantastic place with everything you could ever want and more for software development, but are you using everything it has to offer? Whether you've used GitHub for a while now, or are just starting out, come learn the best ways to use the platform to its fullest potential.", 
    "author": "Brent Beer (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43710", 
    "raw_description": "Presented by Brent Beer (GitHub). GitHub is a large and fantastic place with everything you could ever want and more for software development, but are you using everything it has to offer? Whether you've used GitHub for a while now, or are just starting out, come learn the best ways to use the platform to its fullest potential.", 
    "title": "Everything I wish I knew when I started using GitHub", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "We'll discuss concrete steps your company can take to become a good citizen in various open source communities, strategies to influence upper management and show them that it's in their best interest to become more involved with open source, and some of my experiences with companies I've worked for and how I was able to get them to become more involved with free and open source software.", 
    "author": "Jared Smith (Bluehost)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44965", 
    "raw_description": "Presented by Jared Smith (Bluehost). We'll discuss concrete steps your company can take to become a good citizen in various open source communities, strategies to influence upper management and show them that it's in their best interest to become more involved with open source, and some of my experiences with companies I've worked for and how I was able to get them to become more involved with free and open source software.", 
    "title": "How your company can become a good open source citizen", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 12:30:00-07:00", 
    "description": "In less than half a day, this hands-on workshop will show you how to leverage open source software like Apache Geode, Spring XD, Docker, and Cloud Foundry/Lattice to quickly build a complete IoT solution. The Internet of Things requires new applications to consume data that streams in from connected devices, and apply advanced real-time analytics.", 
    "author": "Fred Melo (Pivotal), William Markito Oliveira (Pivotal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44875", 
    "raw_description": "Presented by Fred Melo (Pivotal), William Markito Oliveira (Pivotal). In less than half a day, this hands-on workshop will show you how to leverage open source software like Apache Geode, Spring XD, Docker, and Cloud Foundry/Lattice to quickly build a complete IoT solution. The Internet of Things requires new applications to consume data that streams in from connected devices, and apply advanced real-time analytics.", 
    "title": "Build your first Internet of Things app today with open source", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "Everyone wants to leverage Hadoop for their data processing needs, whether for real-time processing or batch processing; but there is no single common way to bring data from a variety of data sources and types into Hadoop in an automated fashion. In this talk we cover an approach that we took, and present the generic ingestion framework we developed that leverages Flume, Kafka, and others.", 
    "author": "Sastry Malladi (StubHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44991", 
    "raw_description": "Presented by Sastry Malladi (StubHub). Everyone wants to leverage Hadoop for their data processing needs, whether for real-time processing or batch processing; but there is no single common way to bring data from a variety of data sources and types into Hadoop in an automated fashion. In this talk we cover an approach that we took, and present the generic ingestion framework we developed that leverages Flume, Kafka, and others.", 
    "title": "Streamlining and automating data ingestion into Hadoop", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "Take advantage of F5 scalable application delivery services to accelerate your application development process and migration to cloud architectures.  Integrate with open source orchestration and cloud frameworks Puppet, Chef, Ansible, and OpenStack, enable automation and management of entire application stacks, starting at the server level and moving up to network and security services.", 
    "author": "Matt Quill (F5 Networks)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44997", 
    "raw_description": "Presented by Matt Quill (F5 Networks). Take advantage of F5 scalable application delivery services to accelerate your application development process and migration to cloud architectures.  Integrate with open source orchestration and cloud frameworks Puppet, Chef, Ansible, and OpenStack, enable automation and management of entire application stacks, starting at the server level and moving up to network and security services.", 
    "title": "Take control of your applications", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "This session will give an overview of what the various interpretations of the Internet of Things actually are, and the technologies behind them. It will talk about the IoTivity project, what it is trying to solve, and how it is going about that, including its governance structure and especially its unique relationship with the Open Interconnect Consortium.", 
    "author": "Soohong Park (Samsung)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44962", 
    "raw_description": "Presented by Soohong Park (Samsung). This session will give an overview of what the various interpretations of the Internet of Things actually are, and the technologies behind them. It will talk about the IoTivity project, what it is trying to solve, and how it is going about that, including its governance structure and especially its unique relationship with the Open Interconnect Consortium.", 
    "title": "IoTivity and the Internet of Open Source Things", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "In this presentation, we’ll talk about the work Intel is doing to improve server dynamic languages and some of the successes we’ve achieved, as well as future challenges and how we can help.", 
    "author": "Greg Bentley (Intel)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45153", 
    "raw_description": "Presented by Greg Bentley (Intel). In this presentation, we’ll talk about the work Intel is doing to improve server dynamic languages and some of the successes we’ve achieved, as well as future challenges and how we can help.", 
    "title": "Accelerating the core of the cloud", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-21 13:30:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "This tutorial provides a hands-on introduction to Apache Spark, with coding exercises for Spark apps showing Python, Scala, R, and SQL. We will review the Spark core API, how to build a pipeline with SQL + DataFrames, plus look through the broader Spark ecosystem: Tungsten, Streaming, MLlib, and GraphX.", 
    "author": "Paco Nathan (O'Reilly Media), Haichuan Wang (Huawei), Jacky Li (Huawei technology), Vimal Das Kammath (Huawei)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45358", 
    "raw_description": "Presented by Paco Nathan (O'Reilly Media), Haichuan Wang (Huawei), Jacky Li (Huawei technology), Vimal Das Kammath (Huawei). This tutorial provides a hands-on introduction to Apache Spark, with coding exercises for Spark apps showing Python, Scala, R, and SQL. We will review the Spark core API, how to build a pipeline with SQL + DataFrames, plus look through the broader Spark ecosystem: Tungsten, Streaming, MLlib, and GraphX.", 
    "title": "Apache Spark Tutorial, with deep-dives on SparkR and Data Sources API, plus Telco applications case studies", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 16:10:00-07:00", 
    "end": "2015-07-22 16:50:00-07:00", 
    "description": "Every company is a software company, but crafting good software is hard. This presentation will explore approaches needed to craft good software, look at why these modern architectures patterns are an important part of that story, and how DevOps and monitoring fits into this puzzle.", 
    "author": "Stevan Arychuk (New Relic)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45357", 
    "raw_description": "Presented by Stevan Arychuk (New Relic). Every company is a software company, but crafting good software is hard. This presentation will explore approaches needed to craft good software, look at why these modern architectures patterns are an important part of that story, and how DevOps and monitoring fits into this puzzle.", 
    "title": "The Curate’s Egg of modern architectures (and how DevOps can help)", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "Should Email & Calendaring developers have to choose closed/proprietary protocols in order to get the performance and functionality they need? We don’t think so and we want to tell you why this is no longer a problem! In our session we'll explore how JMAP and Cyrus are coming together to produce a truly modern, robust & scalable solution that is both fun to deploy and simple to manage.", 
    "author": "Neil Jenkins (FastMail)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45415", 
    "raw_description": "Presented by Neil Jenkins (FastMail). Should Email & Calendaring developers have to choose closed/proprietary protocols in order to get the performance and functionality they need? We don’t think so and we want to tell you why this is no longer a problem! In our session we'll explore how JMAP and Cyrus are coming together to produce a truly modern, robust & scalable solution that is both fun to deploy and simple to manage.", 
    "title": "JMAP & Cyrus: Better email – fully open source", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "As teams transition to the world of Fast IT, they need their development lifecycles to keep up. Typical tools require teams dedicate resources for SCM and platform services. Is there an easier way to enable teams to build nextgen applications? Enter the world of Hybrid DevOps, and reach the goal of enabling teams to easily deploy and run their products across hybrid clouds and the Intercloud.", 
    "author": "Ben Schumacher (Cisco)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45517", 
    "raw_description": "Presented by Ben Schumacher (Cisco). As teams transition to the world of Fast IT, they need their development lifecycles to keep up. Typical tools require teams dedicate resources for SCM and platform services. Is there an easier way to enable teams to build nextgen applications? Enter the world of Hybrid DevOps, and reach the goal of enabling teams to easily deploy and run their products across hybrid clouds and the Intercloud.", 
    "title": "Enabling cloud-native application development with microservices", 
    "room": "E142"
  }, 
  {
    "start": "2015-07-22 10:40:00-07:00", 
    "end": "2015-07-22 11:20:00-07:00", 
    "description": "Nowadays, there’s a wide variety of devices, platforms, and screen sizes on which web apps can be run. What if your web app was responsive, adaptive, and able to run on all devices without you having to take care of all the details? We will demonstrate how to build well-designed web apps based on the example of an app we created for one of the most loved sports in Germany: soccer.", 
    "author": "Janina Bläsius (SAP SE), Michael Graf (SAP SE)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44897", 
    "raw_description": "Presented by Janina Bläsius (SAP SE), Michael Graf (SAP SE). Nowadays, there’s a wide variety of devices, platforms, and screen sizes on which web apps can be run. What if your web app was responsive, adaptive, and able to run on all devices without you having to take care of all the details? We will demonstrate how to build well-designed web apps based on the example of an app we created for one of the most loved sports in Germany: soccer.", 
    "title": "No more web app headaches!", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-22 11:30:00-07:00", 
    "end": "2015-07-22 12:10:00-07:00", 
    "description": "When it comes to caching, we fall into two categories - those who make phat stacks of cache money and those who suffer from cache anxiety. In this talk, we’ll cover HTTP caching, old and new strategies for caching historically ‘uncacheable’ content, and secret features of HTTP accelerators like Varnish.", 
    "author": "Michael May (Fastly)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44931", 
    "raw_description": "Presented by Michael May (Fastly). When it comes to caching, we fall into two categories - those who make phat stacks of cache money and those who suffer from cache anxiety. In this talk, we’ll cover HTTP caching, old and new strategies for caching historically ‘uncacheable’ content, and secret features of HTTP accelerators like Varnish.", 
    "title": "Cache money: Tips for going fast in a slow world", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-23 10:40:00-07:00", 
    "end": "2015-07-23 11:20:00-07:00", 
    "description": "Part of the challenge of running a production OpenStack deployment can be scheduling instances.  There are many deployment options; how do you get the guest VM to the correct pool?  How do you efficiently assign guests to hosts?  What if you have pools for specialized deployments?  We'll look at filters, dissect how they work, and how you can leverage them to solve real-world issues.", 
    "author": "Harold Hannon (SoftLayer)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44989", 
    "raw_description": "Presented by Harold Hannon (SoftLayer). Part of the challenge of running a production OpenStack deployment can be scheduling instances.  There are many deployment options; how do you get the guest VM to the correct pool?  How do you efficiently assign guests to hosts?  What if you have pools for specialized deployments?  We'll look at filters, dissect how they work, and how you can leverage them to solve real-world issues.", 
    "title": "Filtering in OpenStack Nova for fun, efficiency, and profit: The anatomy of an OpenStack filter", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-23 13:40:00-07:00", 
    "end": "2015-07-23 14:20:00-07:00", 
    "description": "This session will cover how the Data Platform and Services group at Salesforce.com built a multitenant storage platform, that supports structured relational data access using the open source nonrelational scale-out datastore Apache HBase and its open source \"SQL skin\" Apache Phoenix.", 
    "author": "Andrew Purtell (Salesforce)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45028", 
    "raw_description": "Presented by Andrew Purtell (Salesforce). This session will cover how the Data Platform and Services group at Salesforce.com built a multitenant storage platform, that supports structured relational data access using the open source nonrelational scale-out datastore Apache HBase and its open source \"SQL skin\" Apache Phoenix.", 
    "title": "High scale relational storage at Salesforce built with Apache HBase and Apache Phoenix", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-23 11:30:00-07:00", 
    "end": "2015-07-23 12:10:00-07:00", 
    "description": "In this session, we will share case studies and use cases of developers who have successfully exploited open source technology using IBM z Systems and Power. We will focus on the application development, databases, cloud infrastructure, and big data/analytics categories along with ISV partnerships that can help you get the most out of your open source projects.", 
    "author": "Jim Wasko (IBM), Troy Peterson (IBM Systems Group)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45075", 
    "raw_description": "Presented by Jim Wasko (IBM), Troy Peterson (IBM Systems Group). In this session, we will share case studies and use cases of developers who have successfully exploited open source technology using IBM z Systems and Power. We will focus on the application development, databases, cloud infrastructure, and big data/analytics categories along with ISV partnerships that can help you get the most out of your open source projects.", 
    "title": "Case studies in success: Exploiting the open source Linux ecosystem to drive rapid innovation and higher value", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-22 14:30:00-07:00", 
    "end": "2015-07-22 15:10:00-07:00", 
    "description": "Why do we need an open source way when an emerging technology hits the world's largest market, China? Huawei would help the China community link up with the global community.", 
    "author": "Yujie Du (Huawei Technologies)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45251", 
    "raw_description": "Presented by Yujie Du (Huawei Technologies). Why do we need an open source way when an emerging technology hits the world's largest market, China? Huawei would help the China community link up with the global community.", 
    "title": "Open community for container technology: What does this mean to us?", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-23 14:30:00-07:00", 
    "end": "2015-07-23 15:10:00-07:00", 
    "description": "Code reviews are one of the best ways to improve code quality - however, they can be even more complex than writing the code itself. This talk will help you understand how to conduct effective code reviews and benefit from a strong peer review culture.", 
    "author": "Stephanie Wagner (Namely)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45318", 
    "raw_description": "Presented by Stephanie Wagner (Namely). Code reviews are one of the best ways to improve code quality - however, they can be even more complex than writing the code itself. This talk will help you understand how to conduct effective code reviews and benefit from a strong peer review culture.", 
    "title": "Getting the most out of code review", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-22 17:00:00-07:00", 
    "end": "2015-07-22 17:40:00-07:00", 
    "description": "Docker runs your code in a container, which is like a lightweight VM. A container runs your code directly on the host operating system and hardware, but in an isolated userspace. This way, you get all the isolation and consistency benefits of a VM, but with very little overhead. If you run your code on top of Linux in production, then Docker is for you pair this with Kubernetes and you're all set.", 
    "author": "Patrick Reilly (Kismatic, Inc.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45438", 
    "raw_description": "Presented by Patrick Reilly (Kismatic, Inc.). Docker runs your code in a container, which is like a lightweight VM. A container runs your code directly on the host operating system and hardware, but in an isolated userspace. This way, you get all the isolation and consistency benefits of a VM, but with very little overhead. If you run your code on top of Linux in production, then Docker is for you pair this with Kubernetes and you're all set.", 
    "title": "Development, testing, acceptance and production with Docker and Kubernetes", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-22 13:40:00-07:00", 
    "end": "2015-07-22 14:20:00-07:00", 
    "description": "As Open Source moves out of its teen years, more and more practitioners are younger than the movement. What should grown-up Open Source be doing around communities, licensing, corporate involvement and more? What's the minimum knowledge of history required to not screw up the future of Open Source?", 
    "author": "Danese Cooper (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45724", 
    "raw_description": "Presented by Danese Cooper (PayPal). As Open Source moves out of its teen years, more and more practitioners are younger than the movement. What should grown-up Open Source be doing around communities, licensing, corporate involvement and more? What's the minimum knowledge of history required to not screw up the future of Open Source?", 
    "title": "Open source at 18 - The challenges of post-adolescence", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-23 16:10:00-07:00", 
    "end": "2015-07-23 17:40:00-07:00", 
    "description": "This session provides an introduction to Apache Spark, with a brief overview of how/why it evolved, then covering the Spark core API, with examples in Python and Scala, how to build a pipeline with SQL + DataFrames, plus look through the broader Spark ecosystem: Tungsten, Streaming, MLlib, GraphX, Packages, etc. Plus many links out case studies of production use cases at scale for Spark.", 
    "author": "Paco Nathan (O'Reilly Media), Jacky Li (Huawei technology)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45808", 
    "raw_description": "Presented by Paco Nathan (O'Reilly Media), Jacky Li (Huawei technology). This session provides an introduction to Apache Spark, with a brief overview of how/why it evolved, then covering the Spark core API, with examples in Python and Scala, how to build a pipeline with SQL + DataFrames, plus look through the broader Spark ecosystem: Tungsten, Streaming, MLlib, GraphX, Packages, etc. Plus many links out case studies of production use cases at scale for Spark.", 
    "title": "Intro to Apache Spark, plus Data Sources API integration for HBase", 
    "room": "E 143/144"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "This one-day course provides you with an end-to-end understanding of Linux containers and how to operate and orchestrate them at scale. It will teach you about the low-level concepts that make up Linux containers, best practices on Docker containers, as well as how to orchestrate them using Kubernetes.", 
    "author": "Michael Hausenblas (Mesosphere), Zed Shaw (Mesosphere)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45373", 
    "raw_description": "Presented by Michael Hausenblas (Mesosphere), Zed Shaw (Mesosphere). This one-day course provides you with an end-to-end understanding of Linux containers and how to operate and orchestrate them at scale. It will teach you about the low-level concepts that make up Linux containers, best practices on Docker containers, as well as how to orchestrate them using Kubernetes.", 
    "title": "Kubernetes Bootcamp: Get up to speed with Docker and Kubernetes (SOLD OUT)", 
    "room": "E141"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Adrian will run a two-day training class at OSCON. The class will go into more depth on the business need for speed that leads to microservices, and the characteristics of existing microservice architectures. In addition there will be a hands-on exercise to model your existing architecture, a future state, and the step by step migration to get there.", 
    "author": "Adrian Cockcroft (Battery Ventures)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44066", 
    "raw_description": "Presented by Adrian Cockcroft (Battery Ventures). Adrian will run a two-day training class at OSCON. The class will go into more depth on the business need for speed that leads to microservices, and the characteristics of existing microservice architectures. In addition there will be a hands-on exercise to model your existing architecture, a future state, and the step by step migration to get there.", 
    "title": "Microservices – Why, what and how to get there", 
    "room": "D130"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Adrian will run a two day training class at OSCON. The class will go into more depth on the business need for speed that leads to microservices, and the characteristics of existing microservice architectures. In addition there will be a hands-on exercise to model your existing architecture, a future state, and the step by step migration to get there.", 
    "author": "Adrian Cockcroft (Battery Ventures)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44067", 
    "raw_description": "Presented by Adrian Cockcroft (Battery Ventures). Adrian will run a two day training class at OSCON. The class will go into more depth on the business need for speed that leads to microservices, and the characteristics of existing microservice architectures. In addition there will be a hands-on exercise to model your existing architecture, a future state, and the step by step migration to get there.", 
    "title": "Microservices – Why, what and how to get there (continued)", 
    "room": "D130"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "Reactive programming represents a paradigm shift in the way we reason about system design by embracing the fundamentals of distributed computing. It is this paradigm shift that in turn allows us to build applications that \"react\" to environment changes such as failure and increased load through \"self-healing\" and elastic scaling.", 
    "author": "Duncan DeVore (Typesafe), Henrik Engstrom (Typesafe)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43775", 
    "raw_description": "Presented by Duncan DeVore (Typesafe), Henrik Engstrom (Typesafe). Reactive programming represents a paradigm shift in the way we reason about system design by embracing the fundamentals of distributed computing. It is this paradigm shift that in turn allows us to build applications that \"react\" to environment changes such as failure and increased load through \"self-healing\" and elastic scaling.", 
    "title": "Introduction to reactive programming: Hands-on with Akka, Java, and Scala", 
    "room": "D134"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "Reactive programming represents a paradigm shift in the way we reason about system design by embracing the fundamentals of distributed computing. It is this paradigm shift that in turn allows us to build applications that \"react\" to environment changes such as failure and increased load through \"self-healing\" and elastic scaling.", 
    "author": "Duncan DeVore (Typesafe), Henrik Engstrom (Typesafe)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43777", 
    "raw_description": "Presented by Duncan DeVore (Typesafe), Henrik Engstrom (Typesafe). Reactive programming represents a paradigm shift in the way we reason about system design by embracing the fundamentals of distributed computing. It is this paradigm shift that in turn allows us to build applications that \"react\" to environment changes such as failure and increased load through \"self-healing\" and elastic scaling.", 
    "title": "Introduction to reactive programming: Hands-on with Akka, Java, and Scala (continued)", 
    "room": "D134"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "The Go Bootcamp is a two-day class that provides a comprehensive and idiomatic view of the Go programming language. The class covers topics ranging from language syntax, OOP, concurrency, channels, and testing to debugging and more. The class is great for anyone interested in getting a jumpstart on learning Go, or wanting to understand more about the language and internals.", 
    "author": "William Kennedy (Ardan Studios)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42635", 
    "raw_description": "Presented by William Kennedy (Ardan Studios). The Go Bootcamp is a two-day class that provides a comprehensive and idiomatic view of the Go programming language. The class covers topics ranging from language syntax, OOP, concurrency, channels, and testing to debugging and more. The class is great for anyone interested in getting a jumpstart on learning Go, or wanting to understand more about the language and internals.", 
    "title": "Go Bootcamp training", 
    "room": "D135"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "The Go Bootcamp is a two-day class that provides a comprehensive and idiomatic view of the Go programming language. The class covers topics ranging from language syntax, OOP, concurrency, channels, and testing to debugging and more. The class is great for anyone interested in getting a jumpstart on learning Go, or wanting to understand more about the language and internals.", 
    "author": "William Kennedy (Ardan Studios)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42779", 
    "raw_description": "Presented by William Kennedy (Ardan Studios). The Go Bootcamp is a two-day class that provides a comprehensive and idiomatic view of the Go programming language. The class covers topics ranging from language syntax, OOP, concurrency, channels, and testing to debugging and more. The class is great for anyone interested in getting a jumpstart on learning Go, or wanting to understand more about the language and internals.", 
    "title": "Go Bootcamp training (continued)", 
    "room": "D135"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "If you're involved in writing anything to do with iPhones, iPads, or Macs, you need to get familiar with Swift. This training will bring you from zero Swift knowledge all the way up to a deep understanding of the subject.", 
    "author": "Tim Nugent (lonely.coffee), Jonathon Manning (Secret Lab Pty. Ltd.), Paris Buttfield-Addison (Secret Lab Pty. Ltd.)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42798", 
    "raw_description": "Presented by Tim Nugent (lonely.coffee), Jonathon Manning (Secret Lab Pty. Ltd.), Paris Buttfield-Addison (Secret Lab Pty. Ltd.). If you're involved in writing anything to do with iPhones, iPads, or Macs, you need to get familiar with Swift. This training will bring you from zero Swift knowledge all the way up to a deep understanding of the subject.", 
    "title": "Programming with Swift: Solid fundamentals, advanced language features, and open source libraries (continued)", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "If you're involved in writing anything to do with iPhones, iPads, or Macs, you need to get familiar with Swift. This training will bring you from zero Swift knowledge all the way up to a deep understanding of the subject.", 
    "author": "Jonathon Manning (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42797", 
    "raw_description": "Presented by Jonathon Manning (Secret Lab Pty. Ltd.), Tim Nugent (lonely.coffee). If you're involved in writing anything to do with iPhones, iPads, or Macs, you need to get familiar with Swift. This training will bring you from zero Swift knowledge all the way up to a deep understanding of the subject.", 
    "title": "Programming with Swift: Solid fundamentals, advanced language features, and open source libraries", 
    "room": "E147/148"
  }, 
  {
    "start": "2015-07-20 09:00:00-07:00", 
    "end": "2015-07-20 17:00:00-07:00", 
    "description": "We’re at the cusp of a new network age. The companies defining it are fast, flat, and flexible. They devour data and focus obsessively on their customers. “Analyze and adapt” is their Standing Operating Procedure. At Cultivate, they’ll tell you how they do it—and how you can, too.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43152", 
    "raw_description": "We’re at the cusp of a new network age. The companies defining it are fast, flat, and flexible. They devour data and focus obsessively on their customers. “Analyze and adapt” is their Standing Operating Procedure. At Cultivate, they’ll tell you how they do it—and how you can, too.", 
    "title": "Cultivate: Leading through culture (Presented by O'Reilly and New Relic)", 
    "room": "Portland 256"
  }, 
  {
    "start": "2015-07-21 09:00:00-07:00", 
    "end": "2015-07-21 17:00:00-07:00", 
    "description": "We’re at the cusp of a new network age. The companies defining it are fast, flat, and flexible. They devour data and focus obsessively on their customers. “Analyze and adapt” is their Standing Operating Procedure. At Cultivate, they’ll tell you how they do it—and how you can, too.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43171", 
    "raw_description": "We’re at the cusp of a new network age. The companies defining it are fast, flat, and flexible. They devour data and focus obsessively on their customers. “Analyze and adapt” is their Standing Operating Procedure. At Cultivate, they’ll tell you how they do it—and how you can, too.", 
    "title": "Cultivate: Leading through culture (continued)    (Presented by O'Reilly and New Relic)", 
    "room": "Portland 256"
  }, 
  {
    "start": "2015-07-20 17:30:00-07:00", 
    "end": "2015-07-20 19:00:00-07:00", 
    "description": "If you had five minutes on stage what would you say? What if you only got 20 slides and they rotated automatically after 15 seconds? Would you pitch a project? Launch a web site? Teach a hack? We’ll find out at our annual Ignite event at OSCON. Read more.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42873", 
    "raw_description": "If you had five minutes on stage what would you say? What if you only got 20 slides and they rotated automatically after 15 seconds? Would you pitch a project? Launch a web site? Teach a hack? We’ll find out at our annual Ignite event at OSCON. Read more.", 
    "title": "Ignite OSCON (Sponsored by Bluehost)", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-23 09:05:00-07:00", 
    "end": "2015-07-23 09:20:00-07:00", 
    "description": "Software architecture is important, but shouldn't lead to bureaucratic burdens.", 
    "author": "Martin Fowler (ThoughtWorks)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/43535", 
    "raw_description": "Presented by Martin Fowler (ThoughtWorks). Software architecture is important, but shouldn't lead to bureaucratic burdens.", 
    "title": "Making architecture matter", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-23 09:30:00-07:00", 
    "end": "2015-07-23 09:45:00-07:00", 
    "description": "It wasn’t too long ago that artisans, bathed in the glow of molten metal, forged parts that would go on to make up bigger, more powerful machines. Today, we call those artisans developers. Instead of metal, they use bits and bytes in the cloud to forge a modern application architecture.", 
    "author": "Sam Ramji (Cloud Foundry Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44868", 
    "raw_description": "Presented by Sam Ramji (Cloud Foundry Foundation). It wasn’t too long ago that artisans, bathed in the glow of molten metal, forged parts that would go on to make up bigger, more powerful machines. Today, we call those artisans developers. Instead of metal, they use bits and bytes in the cloud to forge a modern application architecture.", 
    "title": "The making of a cloud native application platform", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-23 09:45:00-07:00", 
    "end": "2015-07-23 10:05:00-07:00", 
    "description": "The Federal Government’s approach to technology is outdated and maddening.  But this dysfunction didn’t come out of thin air—it’s rooted in deep, structural realities.  Less than a year old, the U.S. Digital Service is hacking bureaucracy and improving services millions rely on every day.  Mikey will talk about how that work is going and how the group is spurring change in the open.", 
    "author": "Mikey Dickerson (Federal Government | United States Digital Services Team)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44871", 
    "raw_description": "Presented by Mikey Dickerson (Federal Government | United States Digital Services Team). The Federal Government’s approach to technology is outdated and maddening.  But this dysfunction didn’t come out of thin air—it’s rooted in deep, structural realities.  Less than a year old, the U.S. Digital Service is hacking bureaucracy and improving services millions rely on every day.  Mikey will talk about how that work is going and how the group is spurring change in the open.", 
    "title": "On change-making at the largest public interest startup", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-23 09:00:00-07:00", 
    "end": "2015-07-23 09:05:00-07:00", 
    "description": "Program dhairs Rachel Roumeliotis, Sarah Novotny, and Matthew McCullough open the second day of keynotes.", 
    "author": "Rachel Roumeliotis (O'Reilly Media), Matthew McCullough (GitHub), Sarah Novotny (NGINX)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44925", 
    "raw_description": "Presented by Rachel Roumeliotis (O'Reilly Media), Matthew McCullough (GitHub), Sarah Novotny (NGINX). Program dhairs Rachel Roumeliotis, Sarah Novotny, and Matthew McCullough open the second day of keynotes.", 
    "title": "Thursday opening welcome", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 09:00:00-07:00", 
    "end": "2015-07-24 09:05:00-07:00", 
    "description": "Program chairs Matthew McCullough, Sarah Novotny, and Rachel Roumeliotis open the third day of keynotes.", 
    "author": "Matthew McCullough (GitHub), Sarah Novotny (NGINX), Rachel Roumeliotis (O'Reilly Media)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44936", 
    "raw_description": "Presented by Matthew McCullough (GitHub), Sarah Novotny (NGINX), Rachel Roumeliotis (O'Reilly Media). Program chairs Matthew McCullough, Sarah Novotny, and Rachel Roumeliotis open the third day of keynotes.", 
    "title": "Friday opening welcome", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 09:05:00-07:00", 
    "end": "2015-07-24 09:20:00-07:00", 
    "description": "Re-architecting a system is wrought with problems. However, what we can sometimes forget is the most important aspect of any project: the team! Your team, who miraculously survives these projects, has to continue to change with your business and your technology! But, don't fret, we can architect our way towards this way of thinking!", 
    "author": "Raffi Krikorian (Uber Advanced Technologies Center)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44870", 
    "raw_description": "Presented by Raffi Krikorian (Uber Advanced Technologies Center). Re-architecting a system is wrought with problems. However, what we can sometimes forget is the most important aspect of any project: the team! Your team, who miraculously survives these projects, has to continue to change with your business and your technology! But, don't fret, we can architect our way towards this way of thinking!", 
    "title": "Hacking Conway's Law", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 09:30:00-07:00", 
    "end": "2015-07-24 09:45:00-07:00", 
    "description": "Keila Banks is a 13-year-old African-American girl in the inner city - her talk will be about her story and how people around the world can do coding and computer stuff at any age, with just a little motivation.", 
    "author": "Keila Banks (Student)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44534", 
    "raw_description": "Presented by Keila Banks (Student). Keila Banks is a 13-year-old African-American girl in the inner city - her talk will be about her story and how people around the world can do coding and computer stuff at any age, with just a little motivation.", 
    "title": "Undefinable me: The story of a 13-year-old girl from the inner city who codes", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:00:00-07:00", 
    "end": "2015-07-22 09:05:00-07:00", 
    "description": "Program chairs Sarah Novotny, Rachel Roumeliotis, and Matthew McCullough open the first day of keynotes.", 
    "author": "Sarah Novotny (NGINX), Rachel Roumeliotis (O'Reilly Media), Matthew McCullough (GitHub)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44994", 
    "raw_description": "Presented by Sarah Novotny (NGINX), Rachel Roumeliotis (O'Reilly Media), Matthew McCullough (GitHub). Program chairs Sarah Novotny, Rachel Roumeliotis, and Matthew McCullough open the first day of keynotes.", 
    "title": "Wednesday opening welcome", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:20:00-07:00", 
    "end": "2015-07-22 09:30:00-07:00", 
    "description": "Dr. Angel Diaz, IBM VP Cloud Architecture & Technology, provides a retrospective on the evolution of open source from the “old ways” in the early years to today’s new model of “code, community and culture” which brings together users and developers to accelerate innovation.", 
    "author": "Angel Diaz (IBM)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44737", 
    "raw_description": "Presented by Angel Diaz (IBM). Dr. Angel Diaz, IBM VP Cloud Architecture & Technology, provides a retrospective on the evolution of open source from the “old ways” in the early years to today’s new model of “code, community and culture” which brings together users and developers to accelerate innovation.", 
    "title": "Open Source Lynchpins in 2015: the Anti-Venom to Vendor Lock-in", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:30:00-07:00", 
    "end": "2015-07-22 09:45:00-07:00", 
    "description": "Ship a lot, or ship fast? These goals may seem to be at odds, but it's actually possible to have large, diverse portfolios of open source projects and maintain a fast-moving, iterative approach. In this talk, Facebook's open source lead James Pearce will discuss how Facebook is able to ship open source products twice a week and maintain quality, size, and speed.", 
    "author": "James Pearce (Facebook)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44992", 
    "raw_description": "Presented by James Pearce (Facebook). Ship a lot, or ship fast? These goals may seem to be at odds, but it's actually possible to have large, diverse portfolios of open source projects and maintain a fast-moving, iterative approach. In this talk, Facebook's open source lead James Pearce will discuss how Facebook is able to ship open source products twice a week and maintain quality, size, and speed.", 
    "title": "How Facebook open sources at scale", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:55:00-07:00", 
    "end": "2015-07-22 10:00:00-07:00", 
    "description": "The 21st century is a time with an unprecendented expansion of ideas, culture, technology, information, and global justice. Compared to any ther point in history, humans are *flourishing*. Yet the way in which we think about the world—and our shared future in it—has not accelerated at the same pace. Join us to find out why the future is awesome, and what you can do about it.", 
    "author": "Paul Fenwick (Perl Training Australia)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44917", 
    "raw_description": "Presented by Paul Fenwick (Perl Training Australia). The 21st century is a time with an unprecendented expansion of ideas, culture, technology, information, and global justice. Compared to any ther point in history, humans are *flourishing*. Yet the way in which we think about the world—and our shared future in it—has not accelerated at the same pace. Join us to find out why the future is awesome, and what you can do about it.", 
    "title": "The future is awesome (and what you can do about it)", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:45:00-07:00", 
    "end": "2015-07-22 09:55:00-07:00", 
    "description": "The early days of the open source movement were all about creating an approachable on-ramp to software freedom. We focused strongly on practical benefits of free software and refined the message, hoping to help the professional software sector better understand. We succeeded but success in our first goal doesn't mean we're done, it means we're due to clearly define the next phase of open source.", 
    "author": "Allison Randal (Hewlett-Packard and Open Source Initiative)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44895", 
    "raw_description": "Presented by Allison Randal (Hewlett-Packard and Open Source Initiative). The early days of the open source movement were all about creating an approachable on-ramp to software freedom. We focused strongly on practical benefits of free software and refined the message, hoping to help the professional software sector better understand. We succeeded but success in our first goal doesn't mean we're done, it means we're due to clearly define the next phase of open source.", 
    "title": "They're here. Now what?", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 09:05:00-07:00", 
    "end": "2015-07-22 09:20:00-07:00", 
    "description": "Openness is good for Government on many levels — open data, open standards, open source, open markets. Where we set the way we work in Government, it’s important to let industry determine the technical standards we work with.", 
    "author": "Hadley Beeman (U.K. Government | W3C)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44937", 
    "raw_description": "Presented by Hadley Beeman (U.K. Government | W3C). Openness is good for Government on many levels — open data, open standards, open source, open markets. Where we set the way we work in Government, it’s important to let industry determine the technical standards we work with.", 
    "title": "Making things open", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 09:20:00-07:00", 
    "end": "2015-07-24 09:30:00-07:00", 
    "description": "Nature uses digital coding for replication, storage, and error correction, but relies on analog coding for control. Technology will follow. We are starting to treat streams of bits the way vacuum tubes treat streams of electrons, implementing analog processing upon a digital substrate, the same way digital processing was implemented using analog components, the first time around.", 
    "author": "George Dyson (Independent)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45335", 
    "raw_description": "Presented by George Dyson (Independent). Nature uses digital coding for replication, storage, and error correction, but relies on analog coding for control. Technology will follow. We are starting to treat streams of bits the way vacuum tubes treat streams of electrons, implementing analog processing upon a digital substrate, the same way digital processing was implemented using analog components, the first time around.", 
    "title": "From analog to digital and back", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-23 09:20:00-07:00", 
    "end": "2015-07-23 09:30:00-07:00", 
    "description": "InnerSource is what we call using open source tools and methodologies inside a company to improve engineering practices, and it's gained a foothold at PayPal. We've found it useful for helping to break down engineering silos, increasing emphasis on code craftsmanship and, more generally, for increasing employee collaboration and satisfaction.", 
    "author": "Danese Cooper (PayPal), Arnold Goldberg (PayPal), Manish Jain (PayPal)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45365", 
    "raw_description": "Presented by Danese Cooper (PayPal), Arnold Goldberg (PayPal), Manish Jain (PayPal). InnerSource is what we call using open source tools and methodologies inside a company to improve engineering practices, and it's gained a foothold at PayPal. We've found it useful for helping to break down engineering silos, increasing emphasis on code craftsmanship and, more generally, for increasing employee collaboration and satisfaction.", 
    "title": "Getting started with InnerSource", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 12:00:00-07:00", 
    "end": "2015-07-24 12:05:00-07:00", 
    "description": "The 11th Annual O’Reilly Open Source Award winners will be announced.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45452", 
    "raw_description": "The 11th Annual O’Reilly Open Source Award winners will be announced.", 
    "title": "O'Reilly Open Source Awards", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-24 12:05:00-07:00", 
    "end": "2015-07-24 12:25:00-07:00", 
    "description": "From Portlandia’s capa chuchu chuchu tea to Texas where “Everything is so BIG” that they only have data, OSCON is moving. In this farewell talk to Portland, we will cover the history of navigation from stories to maps, the unexplored lands of open source’s future and the territories open source has already conquered.", 
    "author": "Simon Wardley (Leading Edge Forum (CSC))", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45451", 
    "raw_description": "Presented by Simon Wardley (Leading Edge Forum (CSC)). From Portlandia’s capa chuchu chuchu tea to Texas where “Everything is so BIG” that they only have data, OSCON is moving. In this farewell talk to Portland, we will cover the history of navigation from stories to maps, the unexplored lands of open source’s future and the territories open source has already conquered.", 
    "title": "Situation normal, everything must change", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 10:00:00-07:00", 
    "end": "2015-07-22 10:05:00-07:00", 
    "description": "Jim will provide an update on the latest news from the open source community regarding containers technologies. The Open Container Initiative, formerly known as the Open Container Project, was announced just last month and Zemlin will share the latest information on these efforts and what comes next.", 
    "author": "Jim Zemlin (The Linux Foundation)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45479", 
    "raw_description": "Presented by Jim Zemlin (The Linux Foundation). Jim will provide an update on the latest news from the open source community regarding containers technologies. The Open Container Initiative, formerly known as the Open Container Project, was announced just last month and Zemlin will share the latest information on these efforts and what comes next.", 
    "title": "Advancing open containers through Pan-Industry collaboration", 
    "room": "Portland Ballroom"
  }, 
  {
    "start": "2015-07-22 19:00:00-07:00", 
    "end": "2015-07-22 20:30:00-07:00", 
    "description": "It’s time to celebrate! Are you planning to attend OSCON? Then be sure to join the OpenStack Foundation on Wednesday evening, July 22nd 7:00-9:00pm at the Leftbank Annex located at 101 North Weidler Street, Portland Oregon 97227, to celebrate five years of OpenStack.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44708", 
    "raw_description": "It’s time to celebrate! Are you planning to attend OSCON? Then be sure to join the OpenStack Foundation on Wednesday evening, July 22nd 7:00-9:00pm at the Leftbank Annex located at 101 North Weidler Street, Portland Oregon 97227, to celebrate five years of OpenStack.", 
    "title": "5 Years of OpenStack", 
    "room": "Leftbank Annex"
  }, 
  {
    "start": "2015-07-22 17:40:00-07:00", 
    "end": "2015-07-22 19:00:00-07:00", 
    "description": "Quench your thirst with vendor-hosted libations and snacks while you check out all the cool stuff in the expo hall.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42522", 
    "raw_description": "Quench your thirst with vendor-hosted libations and snacks while you check out all the cool stuff in the expo hall.", 
    "title": "Booth Crawl / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-22 10:10:00-07:00", 
    "end": "2015-07-22 10:40:00-07:00", 
    "description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45364", 
    "raw_description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "title": "Morning Break sponsored by Capital One / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-22 12:10:00-07:00", 
    "end": "2015-07-22 13:40:00-07:00", 
    "description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45366", 
    "raw_description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "title": "Wednesday Lunch (Sponsored by HP) / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-22 15:10:00-07:00", 
    "end": "2015-07-22 16:10:00-07:00", 
    "description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45367", 
    "raw_description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "title": "Afternoon Break Sponsored by SoftLayer / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-23 10:10:00-07:00", 
    "end": "2015-07-23 10:40:00-07:00", 
    "description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "author": "Tim O'Reilly (O'Reilly Media)", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45369", 
    "raw_description": "Presented by Tim O'Reilly (O'Reilly Media). Join O'Reilly speakers for informal question and answer sessions.", 
    "title": "Morning Break Sponsored by New Relic / Ask Me Anything About chat", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-23 12:10:00-07:00", 
    "end": "2015-07-23 13:40:00-07:00", 
    "description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45370", 
    "raw_description": "Join O'Reilly speakers for informal question and answer sessions.", 
    "title": "Thursday Lunch / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-23 15:10:00-07:00", 
    "end": "2015-07-23 16:10:00-07:00", 
    "description": "Join O’Reilly speakers for informal question and answer sessions.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45372", 
    "raw_description": "Join O’Reilly speakers for informal question and answer sessions.", 
    "title": "Afternoon Break Sponsored by Google / Ask Me Anything About chats", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-21 17:00:00-07:00", 
    "end": "2015-07-21 18:00:00-07:00", 
    "description": "Grab a drink and kick off OSCON by meeting and mingling with exhibitors and fellow attendees.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42523", 
    "raw_description": "Grab a drink and kick off OSCON by meeting and mingling with exhibitors and fellow attendees.", 
    "title": "Expo Hall Opening Reception (Sponsored by PayPal)", 
    "room": "Expo Hall"
  }, 
  {
    "start": "2015-07-20 20:30:00-07:00", 
    "end": "2015-07-20 23:00:00-07:00", 
    "description": "The OSCON 5k Glow Run/Walk and Finish Line Festival is back. This year expect more glow, a cool new venue, special effects, frothier foam dance floor, beer, and prizes. Same great views and scenic course around the Waterfront Loop, great dance music, beer garden, and food cart. Take the MAX to Skidmore Station/Saturday Market for Ankeny Plaza Pavilion.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/42524", 
    "raw_description": "The OSCON 5k Glow Run/Walk and Finish Line Festival is back. This year expect more glow, a cool new venue, special effects, frothier foam dance floor, beer, and prizes. Same great views and scenic course around the Waterfront Loop, great dance music, beer garden, and food cart. Take the MAX to Skidmore Station/Saturday Market for Ankeny Plaza Pavilion.", 
    "title": "OSCON 5K Glow Run and After Party (Sponsored by IBM Cloudant, Microsoft and OpenStack)", 
    "room": "Ankeny Plaza Pavilion (near Skidmore Fountain MAX stop)"
  }, 
  {
    "start": "2015-07-21 18:00:00-07:00", 
    "end": "2015-07-21 20:00:00-07:00", 
    "description": "We’ve always suspected our attendees possess super powers and the OSComic attendee party is the perfect place to prove it. You can test your super skills in the Superhero Training Center, then lounge like a hero and power up with super foods or kick back like a villain with sinful snacks. Come as you are and create your own crusader persona or feel free to don your own accessories in advance.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44869", 
    "raw_description": "We’ve always suspected our attendees possess super powers and the OSComic attendee party is the perfect place to prove it. You can test your super skills in the Superhero Training Center, then lounge like a hero and power up with super foods or kick back like a villain with sinful snacks. Come as you are and create your own crusader persona or feel free to don your own accessories in advance.", 
    "title": "OSComic Attendee Party (Co-sponsored by Aerospike, HP Helion and Wipro)", 
    "room": "Hall B"
  }, 
  {
    "start": "2015-07-21 20:00:00-07:00", 
    "end": "2015-07-21 22:00:00-07:00", 
    "description": "Join Puppet Labs for our OSCON “Open” House Party! We are excited to open our doors to all our OSCON and Puppet Labs Friends.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44631", 
    "raw_description": "Join Puppet Labs for our OSCON “Open” House Party! We are excited to open our doors to all our OSCON and Puppet Labs Friends.", 
    "title": "Puppet Labs Party", 
    "room": "Puppet Labs Headquarters (308 SW 2nd Ave., 5th Fl)"
  }, 
  {
    "start": "2015-07-20 19:00:00-07:00", 
    "end": "2015-07-20 20:30:00-07:00", 
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44726", 
    "raw_description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "title": "Monday BoFs", 
    "room": "D136, D137/138, D139/140, E145/146, E147/E148, E141, E142"
  }, 
  {
    "start": "2015-07-23 18:00:00-07:00", 
    "end": "2015-07-23 20:00:00-07:00", 
    "description": "Come join our Walmart eCommerce CTO and Engineering members for an evening full of free bites + brews, mingling and networking on Thursday, July 23rd, 6pm-8pm at Spirit of 77 Bar (across from the convention center)", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/45347", 
    "raw_description": "Come join our Walmart eCommerce CTO and Engineering members for an evening full of free bites + brews, mingling and networking on Thursday, July 23rd, 6pm-8pm at Spirit of 77 Bar (across from the convention center)", 
    "title": "@Walmart Labs Tech Mixer", 
    "room": "Spirit of 77 Bar and Lounge"
  }, 
  {
    "start": "2015-07-22 20:30:00-07:00", 
    "end": "2015-07-22 22:00:00-07:00", 
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44727", 
    "raw_description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "title": "Wednesday BoFs", 
    "room": "D135/136, D137/138, D139/140, E141, E142, E145, E146, E147/E148"
  }, 
  {
    "start": "2015-07-23 20:00:00-07:00", 
    "end": "2015-07-23 22:00:00-07:00", 
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "author": "", 
    "url": "http://www.oscon.com/open-source-2015/public/schedule/detail/44728", 
    "raw_description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.", 
    "title": "Thursday BoFs", 
    "room": "D135/136, D137/138, D139/140, E145, E146, E147/E148"
  }
]
